{
  "backend/main.mo": "Main canister actor managing fields, tasks, user profiles, and authorization with auto-role assignment and user-required guards.",
  "backend/migration.mo": "Migration module converting old Field records by adding totalTaskDuration and producing updated actor state.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to affected files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files describing their purpose and recent behavior changes.",
  "frontend/docs/field-create-failure-repro.md": "Guide documenting reproducible steps and expected behavior for diagnosing field-creation failures.",
  "frontend/docs/profile-save-failure-repro.md": "Detailed analysis of profile-save failures, root causes, implemented fixes, and validation steps.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Base HTML document bootstrapping the React application via preReactGlobals and main.tsx.",
  "frontend/src/App.tsx": "Top-level React component handling boot flow, authentication, profile loading, error recovery, and UI routing.",
  "frontend/src/bootstrap/bootFallback.ts": "Registers global handlers to catch startup errors and render a styled fallback error UI before React mounts.",
  "frontend/src/bootstrap/preReactGlobals.ts": "Initializes browser-safe global shims for process/env and loads boot fallback handlers before React loads.",
  "frontend/src/components/AllTasksView.tsx": "Displays all tasks with search, sorting, and field lookup, rendering task cards or skeletons based on loading state.",
  "frontend/src/components/CreateFieldDialog.tsx": "Dialog for creating a new field with authentication checks and backend mutation handling.",
  "frontend/src/components/CreateTaskDialog.tsx": "Dialog for creating tasks with attribute scales, duration settings, and dependency selection before submitting to backend.",
  "frontend/src/components/EditFieldDialog.tsx": "Dialog to edit an existing field’s name and submit updates to the backend.",
  "frontend/src/components/EditTaskDialog.tsx": "Dialog for editing task properties, dependencies, duration units, and optionally moving the task between fields.",
  "frontend/src/components/FieldCard.tsx": "Displays a clickable summary card for a field with its name, task count, and averaged attribute badges.",
  "frontend/src/components/FieldDetailView.tsx": "Shows detailed field info with attributes, task list filtering/sorting, and dialogs for creating, editing, or deleting tasks and the field.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation bar with theme toggle, user profile dropdown, and logout handling.",
  "frontend/src/components/LoginPrompt.tsx": "Login screen describing app features and providing an Internet Identity login button.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting authenticated users to enter and save their profile name with initialization status handling.",
  "frontend/src/components/RecoverableBootError.tsx": "Centered error UI showing a normalized boot error message and offering a retry action.",
  "frontend/src/components/SortDirectionToggle.tsx": "Button with tooltip to toggle ascending or descending sort direction.",
  "frontend/src/components/TaskCard.tsx": "Renders a task card with attributes, completion/undo logic, dependency display, and edit/delete dialogs.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor based on the current identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines data-fetching and mutation hooks for profiles, fields, and tasks using a resilient actor and tailored retry logic.",
  "frontend/src/hooks/useResilientActor.ts": "Initializes a robust backend actor that retries on network errors and refreshes dependent queries when the actor changes.",
  "frontend/src/index.css": "Defines Tailwind CSS setup and custom theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the app by mounting React, initializing React Query, and wrapping with the Internet Identity provider.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main dashboard UI with field/task views, sorting, filtering, and authentication-aware interactions.",
  "frontend/src/utils/bootErrorMessages.ts": "Provides functions to extract and normalize IC error messages into user-friendly text.",
  "frontend/src/utils/duration.ts": "Utilities for converting between duration units and formatting minutes into readable strings.",
  "frontend/src/utils/fieldCreationErrors.ts": "Normalizes field creation errors into categorized, user-friendly messages using boot error helpers.",
  "frontend/src/utils/profileSaveErrors.ts": "Maps profile save errors to clear categories and messages, handling authorization and IC reject cases.",
  "frontend/src/utils/urlParams.ts": "Functions for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, theming, animations, and plugin setup.",
  "project_state.json": "Describes the current task-management project state, its schema version, and a list of implemented features including CRUD for Fields/Tasks, scoring attributes, dependencies, computed Field stats, and backend APIs. Serves as a snapshot of functionality and requirements coverage."
}