{
  "backend/main.mo": "Motoko canister implementing fields, tasks, user profiles, and access control with user-role enforcement and CRUD operations for fields and tasks.",
  "feature_evidence.json": "Metadata file describing implemented features, affected documentation, components, and test IDs for two deployment-related documentation updates.",
  "frontend-file-summaries.txt": "Mapping of frontend source file paths to short functional descriptions covering components, hooks, dialogs, and UI behavior.",
  "frontend/docs/deploy-and-localdev-regression-checklist.md": "Comprehensive checklist for validating build, deployment, boot flow, authentication, and CRUD functionality in both local and production environments.",
  "frontend/docs/field-create-failure-repro.md": "Guide outlining reproducible steps for testing field-creation failure scenarios, mainly verifying expected behavior for anonymous users.",
  "frontend/docs/production-redeploy-runbook.md": "Runbook detailing prerequisites and procedures for performing a clean production redeploy with state capture and rollback readiness.",
  "frontend/docs/production-smoke-check-procedure.md": "Focused smoke-test procedure for validating critical production functionality immediately after redeploy, aligned with the regression checklist.",
  "frontend/docs/production-smoke-check-results-template.md": "Template for recording production smoke test results covering app load, login, dashboard, CRUD operations, and data import/export.",
  "frontend/docs/profile-save-failure-repro.md": "Documentation describing a profile save error, its root cause, reproduction steps, and the implemented fixes with validation tests.",
  "frontend/index.css": "Tailwind-based global styles defining CSS variables for light and dark themes.",
  "frontend/index.html": "HTML entry point loading the React app and pre-React bootstrap scripts.",
  "frontend/src/App.tsx": "Main React app component handling authentication, boot error detection, retries, and rendering core UI pages and modals.",
  "frontend/src/bootstrap/bootFallback.ts": "Fallback system that displays a detailed error UI if the app fails before React mounts, with sanitization and diagnostics.",
  "frontend/src/bootstrap/preReactGlobals.ts": "Bootstrap script that sets global environment shims and initializes boot fallback before React loads.",
  "frontend/src/components/AllTasksView.tsx": "Displays all tasks with search, sorting, and field name resolution, rendering task cards or loading placeholders.",
  "frontend/src/components/CreateFieldDialog.tsx": "Dialog for creating a new field with name and background selection, handling authentication and backend readiness.",
  "frontend/src/components/CreateTaskDialog.tsx": "Dialog for creating a task with scale-based attributes, duration, and dependency selection, submitting to backend.",
  "frontend/src/components/EditFieldDialog.tsx": "Dialog for editing a field's name, icon, color, and background, reloading values when opened and updating via mutation.",
  "frontend/src/components/EditTaskDialog.tsx": "Dialog for editing task details, duration units, dependencies, and optionally moving tasks between fields.",
  "frontend/src/components/FieldCard.tsx": "Renders a field summary card showing icon, task count, and averaged attributes, styled with field color and background.",
  "frontend/src/components/FieldDetailErrorBoundary.tsx": "React error boundary that catches errors in the field detail view and displays a styled fallback with reset and back actions.",
  "frontend/src/components/FieldDetailView.tsx": "Displays a field's details and its tasks with filtering, sorting, creation, editing, and deletion controls.",
  "frontend/src/components/Footer.tsx": "Simple footer showing copyright text and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation bar handling theme toggle, user identity display, and logout functionality.",
  "frontend/src/components/ImportDataConfirmDialog.tsx": "Confirmation dialog warning users before overwriting all existing data during an import.",
  "frontend/src/components/LoginPrompt.tsx": "Login screen presenting app features and triggering Internet Identity authentication.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to enter their name and save their profile after authentication.",
  "frontend/src/components/RecoverableBootError.tsx": "UI for recoverable boot errors with retry, logout, and expandable diagnostic details.",
  "frontend/src/components/SortDirectionToggle.tsx": "Button component that toggles ascending or descending sort order with tooltip feedback.",
  "frontend/src/components/TaskCard.tsx": "React component rendering a task card with completion, deletion, edit dialogs, dependency display, and attribute badges.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an actor tied to the current identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity authentication, storing identity, login/logout actions, and status management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend data such as user profiles, using a resilient actor and detailed error handling.",
  "frontend/src/hooks/useResilientActor.ts": "Builds an always-available actor with retry logic and invalidates dependent queries when the actor instance changes.",
  "frontend/src/index.css": "Tailwind CSS setup defining color tokens, theming variables, and light/dark field background palettes.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page handling field/task views, authentication state, search/sort, and import/export dialogs.",
  "frontend/src/utils/bootErrorMessages.ts": "Parses IC errors to extract readable messages and detects specific conditions like missing profiles or stopped canisters.",
  "frontend/src/utils/downloadJson.ts": "Utility to serialize data (handling BigInt) and trigger a JSON file download via a generated Blob URL.",
  "frontend/src/utils/duration.ts": "Functions to convert, format, and transform durations across minutes, hours, and days.",
  "frontend/src/utils/exportUserDataErrors.ts": "Normalizes export-user-data errors into categories with user-friendly messages for login, actor readiness, network, or backend issues.",
  "frontend/src/utils/fieldAppearance.ts": "Defines available field icons and colors and provides helpers to resolve icon components and color data safely.",
  "frontend/src/utils/fieldCardBackgrounds.ts": "Defines background color options for field cards and helpers to resolve background data and CSS variable names.",
  "frontend/src/utils/fieldCreationErrors.ts": "Normalizes field-creation errors by detecting login, actor, authorization, or profile issues and producing friendly messages.",
  "frontend/src/utils/parseExportPayload.ts": "Validates and converts exported JSON into typed Field and Task objects, restoring Principals and BigInt values.",
  "frontend/src/utils/profileSaveErrors.ts": "Normalizes profile save errors into clear categories and user-friendly messages based on message patterns and backend traps.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL parameters with session persistence and hash-routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending themes, colors, animations, and plugins for the frontend.",
  "project_state.json": "Describes current project state, issues, and feature tasks related to improving production redeploy workflow and documentation."
}