{
  "backend/main.mo": "Motoko canister implementing user profiles, fields, and tasks with access control, validation, and CRUD operations for authenticated users.",
  "feature_evidence.json": "Feature evidence report listing implemented features, affected files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Collection of short summaries for various frontend components, hooks, and pages describing their responsibilities and recent improvements.",
  "frontend/docs/deploy-and-localdev-regression-checklist.md": "Comprehensive checklist for verifying builds, deployments, and core app behavior during local development and pre-production checks.",
  "frontend/docs/field-create-failure-repro.md": "Guide documenting steps to reproduce and validate field creation failures for anonymous users.",
  "frontend/docs/production-redeploy-runbook.md": "Runbook detailing the process and prerequisites for performing a clean production redeploy of the application.",
  "frontend/docs/production-smoke-check-results-template.md": "Template for recording production smoke test results across authentication, core functionality, and UI flows.",
  "frontend/docs/profile-save-failure-repro.md": "Documentation of a profile save failure, root cause analysis, reproduction steps, fixes applied, and validation tests.",
  "frontend/index.css": "Tailwind setup defining light and dark theme CSS variables and applying base styles.",
  "frontend/index.html": "HTML entry point loading pre-React globals and the main React app.",
  "frontend/src/App.tsx": "Root React component handling auth, boot error detection, retry/logout logic, and rendering core layout.",
  "frontend/src/bootstrap/bootFallback.ts": "Fallback system that shows a styled error UI if the app fails before React mounts.",
  "frontend/src/bootstrap/preReactGlobals.ts": "Initializes global shims and loads boot fallback before React starts.",
  "frontend/src/components/AllTasksView.tsx": "Displays searchable, sortable task list with field lookup and task cards.",
  "frontend/src/components/CreateFieldDialog.tsx": "Dialog for creating a new field with auth checks, backend actor readiness, and background selection.",
  "frontend/src/components/CreateTaskDialog.tsx": "Modal form for creating a task with scale inputs, duration, and dependencies, submitting via useCreateTask. Manages form state and resets on success.",
  "frontend/src/components/EditFieldDialog.tsx": "Dialog for editing a field’s name, icon, color, and background using useUpdateField. Loads initial values on open and updates the field on submit.",
  "frontend/src/components/EditTaskDialog.tsx": "Dialog for editing task attributes, duration, dependencies, and optionally moving the task to another field. Syncs state on open and updates via useUpdateTask or moveTaskToField.",
  "frontend/src/components/FieldCard.tsx": "Displays a field with its icon, name, task count, and averaged attributes, using styling from appearance utilities. Acts as a clickable summary card.",
  "frontend/src/components/FieldDetailErrorBoundary.tsx": "Error boundary that captures rendering failures in the field detail view and shows a recovery UI with reset and back actions.",
  "frontend/src/components/FieldDetailView.tsx": "Full page for viewing a field’s tasks with search, sorting, task creation, field editing, and field deletion. Fetches tasks and displays field-level aggregate metrics.",
  "frontend/src/components/Footer.tsx": "Simple footer showing a © notice and link to caffeine.ai with a decorative heart icon.",
  "frontend/src/components/Header.tsx": "Renders the app header with theme toggle, user avatar menu, and logout handling using Internet Identity and cached profile data.",
  "frontend/src/components/ImportDataConfirmDialog.tsx": "Displays a confirmation dialog for overwriting existing fields and tasks, showing import counts and handling confirmation state.",
  "frontend/src/components/LoginPrompt.tsx": "Shows a login card with feature list and a button to authenticate via Internet Identity.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for initial user profile setup, collecting a name and handling authentication and backend readiness states.",
  "frontend/src/components/RecoverableBootError.tsx": "Displays an error screen with retry, logout, and expandable diagnostic details including clipboard copy support.",
  "frontend/src/components/SortDirectionToggle.tsx": "Provides a button with tooltip to toggle ascending/descending sort direction.",
  "frontend/src/components/TaskCard.tsx": "Renders a task card with completion, undo, edit, and delete actions plus attribute and dependency displays.",
  "frontend/src/hooks/useActor.ts": "Initializes and caches a backend actor tied to the user's identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login flow, stored identity loading, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user-related backend data, with detailed error handling and identity-aware caching.",
  "frontend/src/hooks/useResilientActor.ts": "Initializes and caches a backend actor tied to the current identity, handles retries and errors, and invalidates dependent queries on actor changes.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables, including extensive field background palettes and base styling.",
  "frontend/src/main.tsx": "Bootstraps the React app by wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main dashboard UI with field lists, sorting, search, authentication checks, data import/export, and navigation between fields and tasks.",
  "frontend/src/utils/bootErrorMessages.ts": "Provides helpers to extract text from nested IC errors and classify user-not-registered or stopped-canister errors, plus a safe user-friendly error message extractor.",
  "frontend/src/utils/downloadJson.ts": "Utility to serialize data to JSON (handling BigInt), create a Blob, and trigger a file download with error handling.",
  "frontend/src/utils/duration.ts": "Functions to convert durations between units, compute total minutes, and format minutes into human-readable strings.",
  "frontend/src/utils/exportUserDataErrors.ts": "Normalizes export-data errors into categories with user-friendly messages, covering login, actor, authorization, network, and backend issues.",
  "frontend/src/utils/fieldAppearance.ts": "Defines predefined icons and colors for fields, with helpers to resolve icons and color values safely.",
  "frontend/src/utils/fieldCardBackgrounds.ts": "Provides a list of background color options for field cards and helpers to resolve background definitions and CSS variables.",
  "frontend/src/utils/fieldCreationErrors.ts": "Normalizes field-creation errors with detection for login, actor state, authorization, and missing-profile cases using safe message extraction.",
  "frontend/src/utils/parseExportPayload.ts": "Validates and parses exported JSON data, converting Principals and BigInt-like fields and applying defaults for field appearance values.",
  "frontend/src/utils/profileSaveErrors.ts": "Normalizes profile save errors into categories and user-friendly messages by inspecting error types and messages. Falls back to a safe extracted message for unknown errors.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL parameters, including persistence via sessionStorage. Supports both query-string and hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, container settings, animations, and plugins like typography and container queries. Extends theme tokens for UI elements and charts.",
  "project_state.json": "Describes the project’s state and issues, mainly tracking a blank-screen bug and listing feature fixes such as improving icon-picker resilience and adding an error boundary."
}