{
  "backend/main.mo": "Motoko canister defining user profiles, fields, and tasks with authorization checks, CRUD operations, and metrics tracking.",
  "feature_evidence.json": "Feature evidence report listing UI change requirements, affected frontend files, components, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-formatted summaries describing the purpose and recent updates of various frontend components and hooks.",
  "frontend/docs/deploy-and-localdev-regression-checklist.md": "Deployment and local development checklist covering build validation, login flow, core functionality, and smoke tests.",
  "frontend/docs/field-create-failure-repro.md": "Guide documenting how to reproduce and verify field creation failure scenarios for anonymous users.",
  "frontend/docs/profile-save-failure-repro.md": "Detailed reproduction and fix documentation for a profile save failure, including root cause, fixes, and validation steps.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining color variables and light/dark mode theme tokens.",
  "frontend/index.html": "Basic HTML entry point loading preReact globals and the main React bundle.",
  "frontend/src/App.tsx": "Main app component handling authentication, actor/profile boot logic, and fallback error flows before rendering UI sections like dashboard or login prompts.",
  "frontend/src/bootstrap/bootFallback.ts": "Implements a pre-React error fallback UI that displays sanitized boot errors if the app fails before React mounts.",
  "frontend/src/bootstrap/preReactGlobals.ts": "Sets up browser-safe global shims and environment variables before React loads, then initializes boot fallback handlers.",
  "frontend/src/components/AllTasksView.tsx": "Renders a searchable, sortable list of all tasks across fields, using memoized filtering and sorting.",
  "frontend/src/components/CreateFieldDialog.tsx": "Dialog for creating a new field, handling authentication, actor readiness, input validation, and mutation submission.",
  "frontend/src/components/CreateTaskDialog.tsx": "Dialog for creating tasks with scale inputs, duration, dependencies, and submission via createTask mutation.",
  "frontend/src/components/EditFieldDialog.tsx": "Dialog component for editing a field’s name, icon, and color, with state resets on open and mutation on submit.",
  "frontend/src/components/EditTaskDialog.tsx": "Dialog for editing a task’s attributes, duration, dependencies, and field assignment, including data conversion and update mutations.",
  "frontend/src/components/FieldCard.tsx": "Card UI showing a field’s icon, name, task count, and averaged attributes, using computed colors and icons.",
  "frontend/src/components/FieldDetailView.tsx": "Detailed view of a field with task list filtering, sorting, creation, editing, and field deletion controls.",
  "frontend/src/components/Footer.tsx": "Footer displaying a copyright note and link with a heart icon.",
  "frontend/src/components/Header.tsx": "Header with theme toggle, user profile dropdown, authentication handling, and logout logic.",
  "frontend/src/components/ImportDataConfirmDialog.tsx": "Confirmation dialog warning about overwriting all data during import and showing counts of fields and tasks.",
  "frontend/src/components/LoginPrompt.tsx": "Displays a login screen with feature highlights and a button to authenticate using Internet Identity.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for entering and saving a user name, handling authentication state and backend readiness.",
  "frontend/src/components/RecoverableBootError.tsx": "Shows an error screen with retry, logout, and expandable diagnostic details including copy-to-clipboard.",
  "frontend/src/components/SortDirectionToggle.tsx": "Button that toggles between ascending and descending sort directions with tooltip support.",
  "frontend/src/components/TaskCard.tsx": "Renders an individual task with attributes, dependency display, completion/undo flow, and edit/delete dialogs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication, including login, logout, and stored identity handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, fields, tasks, and export/import operations with detailed error handling and identity-scoped caching.",
  "frontend/src/hooks/useResilientActor.ts": "Initializes and caches a backend actor tied to the user's identity, handling retries, errors, and invalidating dependent queries on identity changes.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark theme CSS variables for colors, borders, and layout styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main dashboard UI for listing, searching, sorting, and managing Fields and Tasks, plus handling user auth, export, and import flows.",
  "frontend/src/utils/bootErrorMessages.ts": "Provides utilities to extract, classify, and sanitize backend error messages, including detection of missing-profile and stopped-canister errors.",
  "frontend/src/utils/downloadJson.ts": "Utility to serialize data (including BigInt) to JSON and trigger a client-side file download.",
  "frontend/src/utils/duration.ts": "Helpers for converting between duration units, formatting minutes into readable text, and preserving total duration across units.",
  "frontend/src/utils/exportUserDataErrors.ts": "Normalizes various export errors into categorized, user-friendly messages covering auth, actor state, network, and backend issues.",
  "frontend/src/utils/fieldAppearance.ts": "Defines predefined icons and colors for fields and provides helpers to resolve icon components and color values with defaults.",
  "frontend/src/utils/fieldCreationErrors.ts": "Maps field-creation errors to short, user-friendly messages for login, actor readiness, authorization, and unknown failures.",
  "frontend/src/utils/parseExportPayload.ts": "Validates and converts exported JSON payloads into typed Field and Task objects, handling BigInt and Principal parsing with defaults.",
  "frontend/src/utils/profileSaveErrors.ts": "Normalizes profile-save errors into login, actor, authorization, or unknown categories using robust message detection.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL and session parameters, supporting hash-based and standard routing.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project state, versioning, and a detailed list of existing frontend and backend features for an ICP task‑management app. Captures authentication, boot flow, actor initialization, error handling, and feature metadata."
}