{
  "backend/main.mo": "Motoko canister defining user profiles, fields, and tasks with access control, including CRUD operations and permission checks.",
  "feature_evidence.json": "Empty feature evidence report structure with no listed features.",
  "frontend-file-summaries.txt": "Collection of summaries for all frontend source files describing components, hooks, dialogs, and styling behavior.",
  "frontend/docs/deploy-and-localdev-regression-checklist.md": "Comprehensive checklist for validating builds, deployments, login flow, and full app functionality in both production and local dev.",
  "frontend/docs/field-create-failure-repro.md": "Guide for reproducing and diagnosing field creation failures, focusing on anonymous user behavior.",
  "frontend/docs/production-redeploy-runbook.md": "Runbook detailing steps and prerequisites for performing a clean production redeploy without adding new features.",
  "frontend/docs/production-smoke-check-procedure.md": "Procedure for a post-deploy production smoke test covering critical path and minimal CRUD validation.",
  "frontend/docs/production-smoke-check-results-template.md": "Template file for recording results of production smoke tests across critical path and core functionality.",
  "frontend/docs/profile-save-failure-repro.md": "Documents the root cause, reproduction steps, fixes, and validation for a profile save failure caused by missing authentication and actor readiness guards.",
  "frontend/index.css": "Defines Tailwind base styles and extensive CSS variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading bootstrap and main scripts.",
  "frontend/src/App.tsx": "Main application component handling authentication, actor/profile loading, boot error logic, and routing to login, profile setup, or dashboard.",
  "frontend/src/bootstrap/bootFallback.ts": "Implements a pre-React boot error UI that shows sanitized startup errors with diagnostics and prevents duplicate displays.",
  "frontend/src/bootstrap/preReactGlobals.ts": "Initializes global shims and environment variables before React loads and sets up boot fallback handlers.",
  "frontend/src/components/AllTasksView.tsx": "Displays all tasks with search, sorting, field lookups, and loading states using data from task and field queries.",
  "frontend/src/components/CreateFieldDialog.tsx": "Dialog component for creating a new field with name and background selection, handling authentication and backend readiness before submission.",
  "frontend/src/components/CreateTaskDialog.tsx": "Form dialog for creating a task with rating attributes, duration settings, and optional task dependencies.",
  "frontend/src/components/EditFieldDialog.tsx": "Dialog for editing an existing field’s name, icon, color, and background, syncing initial values on open and submitting updates.",
  "frontend/src/components/EditTaskDialog.tsx": "Dialog for editing a task’s attributes, duration, dependencies, and field assignment, including duration unit conversions.",
  "frontend/src/components/FieldCard.tsx": "Displays a field summary card showing its icon, name, task count, and averaged attributes with styling based on field appearance settings.",
  "frontend/src/components/FieldDetailErrorBoundary.tsx": "Error boundary that catches rendering errors in field detail views and shows a recovery UI with reset and back actions.",
  "frontend/src/components/FieldDetailView.tsx": "Displays detailed view of a field with task list filtering, sorting, and dialogs for creating, editing, and deleting a field.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with copyright text and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Shows the top navigation bar with theme toggle and user profile menu including logout.",
  "frontend/src/components/ImportDataConfirmDialog.tsx": "Confirmation dialog that warns about overwriting data during import and shows item counts.",
  "frontend/src/components/LoginPrompt.tsx": "Displays a login card with feature list and Internet Identity login button.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting authenticated users to enter and save their profile name with validation states.",
  "frontend/src/components/RecoverableBootError.tsx": "Shows an error screen with retry, logout, and expandable technical details including copy-to-clipboard.",
  "frontend/src/components/SortDirectionToggle.tsx": "Button component to toggle ascending/descending sort order with tooltip.",
  "frontend/src/components/TaskCard.tsx": "React component displaying a task card with completion, deletion, editing, and attribute rendering logic.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching an actor tied to the user's identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity authentication, login flow, and stored identity restoration.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles, fields, tasks, and export actions using a resilient actor.",
  "frontend/src/hooks/useResilientActor.ts": "Hook that initializes a robust actor instance with retries and invalidates caches when identity changes.",
  "frontend/src/index.css": "Tailwind CSS base with light/dark theme variables and custom field background color definitions.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/Dashboard.tsx": "React dashboard page that manages fields and tasks, including search, sorting, authentication state, and import/export dialogs.",
  "frontend/src/utils/bootErrorMessages.ts": "Provides helpers to extract readable text from IC errors and detect specific conditions like missing profiles or stopped canisters.",
  "frontend/src/utils/downloadJson.ts": "Utility to serialize data to JSON, handle BigInt values, and trigger a file download.",
  "frontend/src/utils/duration.ts": "Helpers for converting and formatting durations across minutes, hours, and days.",
  "frontend/src/utils/exportUserDataErrors.ts": "Normalizes export-data errors into user-friendly categories and messages.",
  "frontend/src/utils/fieldAppearance.ts": "Defines icon and color presets for fields and provides safe lookup functions with fallbacks.",
  "frontend/src/utils/fieldCardBackgrounds.ts": "Lists available field card background styles and utilities for retrieving them and their CSS variables.",
  "frontend/src/utils/fieldCreationErrors.ts": "Normalizes field-creation errors into categories with safe, user-facing messages.",
  "frontend/src/utils/parseExportPayload.ts": "Validates and converts exported JSON into typed field and task objects, restoring Principals and BigInt values with defaults for older exports.",
  "frontend/src/utils/profileSaveErrors.ts": "Normalizes backend and auth-related profile save errors into user-friendly categories and messages.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters, including hash-based routing support and sessionStorage fallback.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, container settings, and enabling plugins like typography and container queries.",
  "project_state.json": "Project metadata file describing schema version, known issues, and request context for the current task."
}