{
  "backend/main.mo": "Motoko backend actor managing users, fields, and tasks with role-based access control and CRUD operations including backgroundColor on fields.",
  "backend/migration.mo": "Migration module converting old field data to new format by adding a default backgroundColor field.",
  "feature_evidence.json": "Feature evidence report mapping feature requests to impacted frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and recent changes of all major frontend components.",
  "frontend/docs/deploy-and-localdev-regression-checklist.md": "Checklist for validating builds, deployments, login flow, and core functionality in local and production environments.",
  "frontend/docs/field-create-failure-repro.md": "Guide documenting reproducible steps for diagnosing field creation failures, especially for anonymous users.",
  "frontend/docs/production-redeploy-runbook.md": "Runbook outlining steps for performing a clean production redeploy with verification and prerequisites.",
  "frontend/docs/production-smoke-check-results-template.md": "Template for recording production smoke test results covering login, dashboard, CRUD flows, and export/import.",
  "frontend/docs/profile-save-failure-repro.md": "Explains a profile-save race condition after login, its root cause, reproduction steps, implemented guards and error normalization, and validation tests.",
  "frontend/index.css": "Defines Tailwind base layers and extensive CSS variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading bootstrap and main scripts.",
  "frontend/src/App.tsx": "Main app component handling authentication, actor/profile boot logic, error states, and routing to login, setup, or dashboard.",
  "frontend/src/bootstrap/bootFallback.ts": "Implements a pre-React boot error UI with sanitized error details and copy‑ready diagnostics.",
  "frontend/src/bootstrap/preReactGlobals.ts": "Sets up global shims and environment variables before React loads and initializes boot fallback handlers.",
  "frontend/src/components/AllTasksView.tsx": "Task list view supporting search, sorting, field lookup, and loading states using task and field queries.",
  "frontend/src/components/CreateFieldDialog.tsx": "Dialog component for creating a new field, handling authentication, actor readiness, and background selection.",
  "frontend/src/components/CreateTaskDialog.tsx": "Dialog for creating a task within a field, including scales, duration settings, and dependency selection.",
  "frontend/src/components/EditFieldDialog.tsx": "Dialog for editing a field's name, icon, color, and background with updates persisted via mutation.",
  "frontend/src/components/EditTaskDialog.tsx": "Dialog for editing a task's attributes, duration, dependencies, and optionally moving it to another field.",
  "frontend/src/components/FieldCard.tsx": "Card UI showing a field’s name, icon, task count, and aggregated attribute metrics with styled background.",
  "frontend/src/components/FieldDetailView.tsx": "Detailed view of a field showing sortable/filterable tasks, field stats, and controls for creating, editing, or deleting the field.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with a copyright notice and link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Displays the app header with theme toggle, user avatar menu, and logout handling based on Internet Identity state.",
  "frontend/src/components/ImportDataConfirmDialog.tsx": "Confirmation dialog warning users before overwriting all fields and tasks during data import.",
  "frontend/src/components/LoginPrompt.tsx": "Shows a login card with feature list and Internet Identity login button.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for entering and saving a user name, with authentication and backend readiness checks.",
  "frontend/src/components/RecoverableBootError.tsx": "Displays a recoverable boot error with retry, logout options, and expandable diagnostic details.",
  "frontend/src/components/SortDirectionToggle.tsx": "Button to toggle ascending or descending sort direction with tooltip.",
  "frontend/src/components/TaskCard.tsx": "Card UI for viewing, completing, editing, and deleting a task, including attributes and dependency handling.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the current identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, exposing identity, login, logout, and status flags. Handles AuthClient creation and restores identities from storage.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profile, fields, tasks, and data export/import, with detailed error handling and identity‑aware caching. Integrates backend actor calls and normalizes backend error cases.",
  "frontend/src/hooks/useResilientActor.ts": "Creates and caches a backend actor tied to the current identity, retrying only on network errors and invalidating dependent queries on actor changes. Ensures actor availability once identity initialization completes.",
  "frontend/src/index.css": "Configures Tailwind CSS layers and defines light/dark theme color variables, including custom field background colors. Applies global background, text, and border styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers. Loads global styles and renders the root App component.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main dashboard UI with field listing, sorting, searching, authentication‑gated actions, and import/export features. Coordinates queries, actor readiness, and selection state for fields and tasks.",
  "frontend/src/utils/bootErrorMessages.ts": "Provides utilities to extract error text, detect specific IC error types, and generate safe user-facing error messages.",
  "frontend/src/utils/downloadJson.ts": "Exports objects as downloadable JSON files with BigInt handling and automatic filename generation.",
  "frontend/src/utils/duration.ts": "Converts durations between units, formats total minutes, and provides helper functions for consistent time handling.",
  "frontend/src/utils/exportUserDataErrors.ts": "Normalizes errors during user data export into categorized, user-friendly messages.",
  "frontend/src/utils/fieldAppearance.ts": "Defines icon and color presets for fields and provides lookup helpers with defaults.",
  "frontend/src/utils/fieldCardBackgrounds.ts": "Provides predefined field card background options with helpers for lookup and CSS variable mapping.",
  "frontend/src/utils/fieldCreationErrors.ts": "Normalizes field creation errors using category detection and safe message extraction.",
  "frontend/src/utils/parseExportPayload.ts": "Validates and parses exported JSON payloads, restoring types like Principals and BigInts with defaults for missing visual fields.",
  "frontend/src/utils/profileSaveErrors.ts": "Normalizes profile save errors into categorized, user-friendly messages by detecting login, actor, authorization, and unknown cases.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from URL hashes.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radii, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Stores project metadata, existing features, and pending requests related to dashboard field card layout and background color options."
}