{
  "backend/main.mo": "Motoko backend defining user profiles, fields, tasks, authorization checks, and CRUD logic for fields and tasks.",
  "feature_evidence.json": "Feature evidence listing two color-safety fixes with associated files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to brief summaries describing component behavior and recent fixes.",
  "frontend/docs/deploy-and-localdev-regression-checklist.md": "Comprehensive regression checklist covering build, deploy, boot flow, authentication, and CRUD tests.",
  "frontend/docs/field-create-failure-repro.md": "Guide documenting reproducible steps for testing field creation failures, mainly authentication-related.",
  "frontend/docs/production-redeploy-runbook.md": "Runbook detailing full procedure for performing a safe production redeploy with prerequisites and validation steps.",
  "frontend/docs/production-smoke-check-procedure.md": "Concise post-deploy smoke test procedure verifying critical path and essential CRUD flows.",
  "frontend/docs/production-smoke-check-results-template.md": "Template for recording smoke test results across critical path and CRUD functionality after production deploy.",
  "frontend/docs/profile-save-failure-repro.md": "Explains the root cause, reproduction steps, and fixes for a profile save failure triggered by missing authentication and actor-readiness guards.",
  "frontend/index.css": "Tailwind base and theme CSS defining light/dark design tokens and global styling.",
  "frontend/index.html": "Basic HTML shell that mounts the React app and loads bootstrap and main scripts.",
  "frontend/src/App.tsx": "Main app component handling auth boot flow, profile loading, stuck-state watchdog, and routing to login, profile setup, or dashboard.",
  "frontend/src/bootstrap/bootFallback.ts": "Shows a non-React fallback error UI with diagnostics if the app fails before React mounts.",
  "frontend/src/bootstrap/preReactGlobals.ts": "Initializes global boot diagnostics, environment shims, and loads boot fallback handlers before React.",
  "frontend/src/components/AllTasksView.tsx": "Task list view providing search, sorting, and rendering of all tasks with task cards.",
  "frontend/src/components/AppErrorBoundary.tsx": "A top-level React error boundary that catches render errors, logs diagnostics, and shows a fallback UI with retry, logout, and copy-to-clipboard options.",
  "frontend/src/components/CreateFieldDialog.tsx": "Dialog for creating a new field with name and background selection, enforcing authentication and actor readiness before submission.",
  "frontend/src/components/CreateTaskDialog.tsx": "Dialog for creating a new task with 1–5 scale attributes, duration, and dependency selection for a specific field.",
  "frontend/src/components/EditFieldDialog.tsx": "Dialog for editing an existing field’s name, icon, color, and background, with previews and state reset on open.",
  "frontend/src/components/EditTaskDialog.tsx": "Dialog for editing a task’s attributes, duration, dependencies, and field assignment, with data normalization and field lookup.",
  "frontend/src/components/FieldCard.tsx": "A clickable card displaying a field’s icon, stats, task count, and soft-tinted background styling from appearance utilities.",
  "frontend/src/components/FieldDetailErrorBoundary.tsx": "React error boundary that catches render errors in field detail views and shows a styled fallback with reset and back actions.",
  "frontend/src/components/FieldDetailView.tsx": "Displays a field’s tasks with filtering, sorting, metrics, and dialogs for creating, editing, and deleting fields and tasks.",
  "frontend/src/components/Footer.tsx": "Simple footer showing copyright and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation bar providing theme toggle, user profile menu, and logout handling via Internet Identity.",
  "frontend/src/components/ImportDataConfirmDialog.tsx": "Confirmation dialog warning the user before overwriting all existing data during import.",
  "frontend/src/components/LoginPrompt.tsx": "Landing card prompting users to log in with Internet Identity and listing key features.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for initial user profile setup, allowing name entry and showing auth/initialization state.",
  "frontend/src/components/RecoverableBootError.tsx": "Error screen for recoverable boot failures with diagnostics, detail toggle, copy-to-clipboard, retry, and logout options.",
  "frontend/src/components/SortDirectionToggle.tsx": "Button with tooltip for toggling ascending/descending sort direction.",
  "frontend/src/components/TaskCard.tsx": "Renders a task card with completion, edit, delete, and attribute display logic using various UI components and hooks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useBootWatchdog.ts": "Provides a watchdog to detect stalled app initialization states and report timeout reasons.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, initialization, login, logout, and exposes identity context to the app.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, fields, tasks, and related mutations with custom error handling and actor dependencies.",
  "frontend/src/hooks/useResilientActor.ts": "Wraps the base actor with additional checks and retries to ensure stable actor initialization and error annotation.",
  "frontend/src/index.css": "Tailwind-based global styles defining color tokens, dark mode variants, and component layer customizations.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, then renders the root component.",
  "frontend/src/pages/Dashboard.tsx": "React dashboard page managing field/task views, authentication state, sorting, searching, and data import/export workflows.",
  "frontend/src/utils/bootErrorMessages.ts": "Provides utilities to detect and normalize boot-time errors into safe, user-friendly diagnostics.",
  "frontend/src/utils/downloadJson.ts": "Utility for downloading JavaScript data as a JSON file with BigInt-safe serialization.",
  "frontend/src/utils/duration.ts": "Duration conversion helpers for minutes, hours, and days plus human-readable formatting.",
  "frontend/src/utils/exportUserDataErrors.ts": "Normalizes export-user-data errors into categorized, user-facing messages.",
  "frontend/src/utils/fieldAppearance.ts": "Defines icon and color presets for fields and utilities to resolve icons and colors safely.",
  "frontend/src/utils/fieldCardBackgrounds.ts": "Provides predefined field card background options and helpers to resolve CSS variables.",
  "frontend/src/utils/fieldCreationErrors.ts": "Normalizes field-creation errors into friendly messages with categorized causes.",
  "frontend/src/utils/lucideIconMap.ts": "Defines a production-safe registry of Lucide icons plus a fallback icon for dynamic lookup.",
  "frontend/src/utils/parseExportPayload.ts": "Parses and validates exported JSON, converting strings to Principals and BigInts while applying defaults for missing visual fields.",
  "frontend/src/utils/profileSaveErrors.ts": "Normalizes various profile save errors into categorized, user-friendly messages.",
  "frontend/src/utils/softColorTint.ts": "Generates soft tint background colors with hex validation and fallbacks, supporting light/dark mode mixing.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, container settings, animations, and plugin integrations.",
  "project_state.json": "Describes project metadata, issues, and features focused on handling invalid field colors and preventing login render crashes."
}