{
  "backend/main.mo": "Motoko canister implementing fields, tasks, user profiles, and authorization with CRUD operations and permission checks.",
  "feature_evidence.json": "Feature evidence report mapping UI background-opacity fixes to affected components and test IDs.",
  "frontend-file-summaries.txt": "List of frontend files with brief descriptions of functionality and recent enhancements.",
  "frontend/docs/deploy-and-localdev-regression-checklist.md": "Comprehensive checklist for validating builds, deployments, login flow, and core frontend functionality.",
  "frontend/docs/field-create-failure-repro.md": "Steps to reproduce and verify behavior for field creation failures, mainly for anonymous users.",
  "frontend/docs/production-redeploy-runbook.md": "Runbook describing steps, prerequisites, and safeguards for performing a clean production redeploy.",
  "frontend/docs/production-smoke-check-procedure.md": "Short smoke test procedure for verifying critical path and basic CRUD functionality after production redeploy.",
  "frontend/docs/production-smoke-check-results-template.md": "Template for recording pass/fail results of the production smoke check procedure.",
  "frontend/docs/profile-save-failure-repro.md": "Explains the root cause of profile save failures, how to reproduce them, and the fixes added to guards, error handling, and UI.",
  "frontend/index.css": "Defines Tailwind base layers and extensive CSS variables for light and dark themes.",
  "frontend/index.html": "HTML entry point creating the root element and loading the bootstrap and main app scripts.",
  "frontend/src/App.tsx": "Main application component handling authentication, actor and profile loading, boot error detection, and retry/logout flows.",
  "frontend/src/bootstrap/bootFallback.ts": "Implements a pre-React error fallback UI with sanitization, diagnostics, and copyable error details.",
  "frontend/src/bootstrap/preReactGlobals.ts": "Sets up global shims and environment variables before React loads and initializes boot fallback handlers.",
  "frontend/src/components/AllTasksView.tsx": "Renders all tasks with search, sorting, and field lookup, using task and field query data.",
  "frontend/src/components/CreateFieldDialog.tsx": "Modal for creating a field with name and background selection, handling authentication and actor readiness before submitting.",
  "frontend/src/components/CreateTaskDialog.tsx": "Modal for creating a task with attributes, duration, and dependencies, submitting via useCreateTask.",
  "frontend/src/components/EditFieldDialog.tsx": "Modal for editing a field’s name, icon, color, and background, resetting values on open and submitting updates.",
  "frontend/src/components/EditTaskDialog.tsx": "Modal for editing task details including attributes, duration, dependencies, and optionally moving it to another field.",
  "frontend/src/components/FieldCard.tsx": "Displays a field summary card with icon, task count, and averaged attributes, styled using field appearance settings.",
  "frontend/src/components/FieldDetailErrorBoundary.tsx": "Error boundary that catches rendering errors in field detail views and shows a recovery UI with back and retry actions.",
  "frontend/src/components/FieldDetailView.tsx": "Displays details for a field, including sortable and searchable tasks, field metrics, and dialogs for creating, editing, and deleting fields or tasks.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Shows the app header with theme toggle, user profile menu, and logout handling using Internet Identity.",
  "frontend/src/components/ImportDataConfirmDialog.tsx": "A confirmation dialog that warns users before overwriting all existing data during an import operation.",
  "frontend/src/components/LoginPrompt.tsx": "Displays a login screen highlighting app features and prompting users to authenticate via Internet Identity.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for entering and saving a user's name during initial setup, with status messages and backend readiness checks.",
  "frontend/src/components/RecoverableBootError.tsx": "Shows an error screen for recoverable boot failures with retry, logout, and detailed diagnostics display.",
  "frontend/src/components/SortDirectionToggle.tsx": "A button with tooltip that toggles between ascending and descending sort directions.",
  "frontend/src/components/TaskCard.tsx": "Renders a task card with completion, editing, deletion, and attribute display, using toast-based undo and dependency lookup.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout, and identity loading via context and AuthClient integration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, fields, tasks, and exports using a resilient actor.",
  "frontend/src/hooks/useResilientActor.ts": "Builds a fault-tolerant backend actor that retries on network errors and invalidates dependent queries when the actor changes.",
  "frontend/src/index.css": "Tailwind setup defining light/dark theme tokens and field background color variables.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity provider and loads global styles.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page handling field/task views, authentication state, filtering, sorting, and import/export logic.",
  "frontend/src/utils/bootErrorMessages.ts": "Utility helpers to extract error text and classify IC-related errors into friendly messages.",
  "frontend/src/utils/downloadJson.ts": "Exports arbitrary data as a downloadable JSON file with BigInt-safe serialization.",
  "frontend/src/utils/duration.ts": "Provides duration conversion utilities between minutes, hours, and days, plus human-readable formatting.",
  "frontend/src/utils/exportUserDataErrors.ts": "Normalizes export-user-data errors into categories with user-friendly messages.",
  "frontend/src/utils/fieldAppearance.ts": "Defines selectable icon and color sets for fields and resolves icon/color values safely.",
  "frontend/src/utils/fieldCardBackgrounds.ts": "Defines background color options for field cards with helpers for lookup and CSS variable mapping.",
  "frontend/src/utils/fieldCreationErrors.ts": "Normalizes field-creation errors, detecting login, authorization, and profile issues.",
  "frontend/src/utils/parseExportPayload.ts": "Validates and converts exported JSON into typed payloads, restoring Principals and BigInt fields and applying defaults for missing field properties.",
  "frontend/src/utils/profileSaveErrors.ts": "Normalizes profile save errors into categorized, user-friendly messages, handling login, actor state, authorization, and unknown issues.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL and session parameters, including support for hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state describing requirements and issues focused on fixing transparent backgrounds on task cards and modals."
}