{
  "backend/main.mo": "Motoko canister implementing core domain logic for users, fields, and tasks with authorization checks, profile management, and CRUD operations. It maintains aggregate metrics on fields and enforces ownership and role-based access control.",
  "feature_evidence.json": "Structured report mapping high-confidence features to related files, components, and test requirements, focused on reproducing and fixing field creation failures. Serves as traceability and evidence for implemented fixes.",
  "frontend-file-summaries.txt": "Prewritten summaries of frontend source files describing responsibilities, recent fixes, and UI/UX behavior. Used as documentation to quickly understand the frontend architecture and changes.",
  "frontend/docs/field-create-failure-repro.md": "Step-by-step guide to reproduce and validate field creation failure scenarios, starting with anonymous users. Documents expected vs actual behavior for debugging.",
  "frontend/index.css": "Global Tailwind CSS configuration defining light and dark themes using OKLCH color variables. Establishes base styles, color tokens, and layout defaults.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads bootstrap and main TypeScript modules. Defines basic metadata and the root container.",
  "frontend/src/App.tsx": "Top-level React component orchestrating authentication, actor readiness, boot error handling, and routing between dashboard, login, and profile setup flows. Implements retry logic for recoverable boot failures.",
  "frontend/src/bootstrap/bootFallback.ts": "Pre-React bootstrap error handler that captures fatal startup errors and renders a static fallback UI. Registers global error and unhandled rejection listeners with user-friendly retry messaging.",
  "frontend/src/bootstrap/preReactGlobals.ts": "Bootstraps browser-safe global shims (process, process.env, global) and maps Vite env variables before React loads to prevent runtime ReferenceErrors.",
  "frontend/src/components/AllTasksView.tsx": "Renders a searchable and sortable list of all tasks across fields, with client-side filtering, sorting controls, and loading/empty states.",
  "frontend/src/components/CreateFieldDialog.tsx": "Dialog component for creating a new field, handling authentication, backend readiness, form submission, and login prompts.",
  "frontend/src/components/CreateTaskDialog.tsx": "Dialog for creating a new task within a field, collecting scaled attributes, duration, dependencies, and submitting via a create-task mutation.",
  "frontend/src/components/EditFieldDialog.tsx": "Dialog for renaming an existing field, syncing state on open and submitting updates through an update-field mutation.",
  "frontend/src/components/EditTaskDialog.tsx": "Dialog for editing an existing task’s attributes, duration, dependencies, and field assignment, including unit conversion and backend updates.",
  "frontend/src/components/FieldCard.tsx": "Clickable summary card for a field showing task count and aggregated attribute metrics with icons and formatted total duration.",
  "frontend/src/components/FieldDetailView.tsx": "Renders a detailed view of a field with its tasks, including search, sorting, metrics display, and dialogs to create/edit tasks or edit/delete the field.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright text, a heart icon, and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation header with app title, theme toggle, and authenticated user menu showing profile info and logout.",
  "frontend/src/components/LoginPrompt.tsx": "Landing prompt for unauthenticated users that highlights app features and provides Internet Identity login.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that forces new users to enter and save their display name before continuing.",
  "frontend/src/components/RecoverableBootError.tsx": "Error screen for recoverable startup failures with a normalized message and a retry action.",
  "frontend/src/components/SortDirectionToggle.tsx": "Reusable button with tooltip to toggle ascending/descending sort direction.",
  "frontend/src/components/TaskCard.tsx": "Card component for displaying and managing a task, including completion, undo, edit, delete, dependencies, and attribute badges.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches a backend actor based on authentication state and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context, provider, and hook to manage Internet Identity authentication, including login/logout, persisted identities, and detailed login status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as user profiles, fields, and tasks, with error handling, retries, and UI notifications.",
  "frontend/src/hooks/useResilientActor.ts": "Creates and caches an authenticated or anonymous backend actor based on the current identity, handling retries, access control initialization, and cache invalidation on actor changes.",
  "frontend/src/index.css": "Sets up Tailwind CSS base styles and defines extensive CSS variables for light and dark themes, including colors, layout tokens, and component styling.",
  "frontend/src/main.tsx": "Bootstraps the React application by creating the root, configuring the React Query client, and wrapping the app with query and Internet Identity providers.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main dashboard UI with field and task views, authentication-aware actions, and client-side search, filter, sort, and selection logic.",
  "frontend/src/utils/bootErrorMessages.ts": "Contains helpers to detect specific boot-time errors (like unregistered users) and normalize unknown backend or network errors into user-friendly messages.",
  "frontend/src/utils/duration.ts": "Provides utility functions to convert and format durations between minutes, hours, and days, including human-readable formatting.",
  "frontend/src/utils/fieldCreationErrors.ts": "Defines types and a helper to normalize unknown field-creation errors into user-friendly messages, categorizing them (e.g., login required, actor initializing/unavailable, authorization, unknown) based on error message inspection.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read URL parameters from query strings or hash routes, persist them in sessionStorage, retrieve/clear them, and remove sensitive parameters from the URL hash without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, scanning frontend sources, extending the theme with CSS-variable-based colors, layout settings, animations, and registering typography, container queries, and animation plugins.",
  "project_state.json": "Structured snapshot of the project’s current state, including schema/version metadata and a detailed list of implemented features for the Fields/Tasks task-management system with descriptions, requirement links, and versions."
}