{
  "backend/main.mo": "Motoko backend defining user profiles, fields, and tasks with access control, auto-assigning user roles and exposing CRUD methods for profiles and fields.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and tests.",
  "frontend-file-summaries.txt": "Collection of short descriptions summarizing the purpose and behavior of each frontend source file.",
  "frontend/docs/field-create-failure-repro.md": "Guide describing steps to reproduce and verify fixes for field creation failures in different authentication states.",
  "frontend/docs/profile-save-failure-repro.md": "Documentation of the root cause, fixes, and validation steps for profile save failures after login.",
  "frontend/index.css": "Tailwind-based global style definitions including OKLCH theme variables for light and dark modes.",
  "frontend/index.html": "Base HTML file that loads the React app entry scripts into the root element.",
  "frontend/src/App.tsx": "Main React app component orchestrating authentication, actor readiness, profile fetching, boot error handling, and profile setup flow.",
  "frontend/src/bootstrap/bootFallback.ts": "Registers global error handlers and renders a fallback HTML UI when the app fails before React loads.",
  "frontend/src/bootstrap/preReactGlobals.ts": "Initializes global shims like process/env and imports boot fallback handlers before React mounts.",
  "frontend/src/components/AllTasksView.tsx": "Displays all tasks with search, sorting, and field name resolution, showing loading skeletons or task cards.",
  "frontend/src/components/CreateFieldDialog.tsx": "Dialog for creating a new field with authentication checks and backend mutation handling.",
  "frontend/src/components/CreateTaskDialog.tsx": "Dialog for creating a task with scale inputs, duration settings, and dependency selection, submitting via mutation.",
  "frontend/src/components/EditFieldDialog.tsx": "Dialog for renaming a field, syncing initial state on open and submitting updates to the backend.",
  "frontend/src/components/EditTaskDialog.tsx": "Dialog for editing a task’s attributes, duration, dependencies, and field assignment, with unit conversion and backend updates.",
  "frontend/src/components/FieldCard.tsx": "Displays a clickable card for a field showing its name, task count, and key attribute metrics with icons.",
  "frontend/src/components/FieldDetailView.tsx": "Provides a detailed field view with task list filtering, sorting, CRUD actions, and field-level attribute summaries.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with copyright text and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Shows the top navigation bar with theme toggle, user avatar menu, and logout handling via Internet Identity.",
  "frontend/src/components/LoginPrompt.tsx": "Displays a welcome card listing app features and provides an Internet Identity login button.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal that prompts authenticated users to set their profile name and handles backend save state.",
  "frontend/src/components/RecoverableBootError.tsx": "Shows a recoverable error message with retry support and optional loading state.",
  "frontend/src/components/SortDirectionToggle.tsx": "Button with tooltip to toggle ascending/descending sort order.",
  "frontend/src/components/TaskCard.tsx": "Renders an individual task with attributes, completion/undo flow, edit and delete options, and dependency display.",
  "frontend/src/hooks/useActor.ts": "Creates an authenticated or anonymous backend actor via React Query and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login state, identity loading, and an authentication context for the app.",
  "frontend/src/hooks/useQueries.ts": "Defines profile‑ and field‑related queries and mutations using a resilient actor with custom retry and error handling logic.",
  "frontend/src/hooks/useResilientActor.ts": "Builds a persistent backend actor with safer initialization, limited retries, and automatic cache invalidation on identity changes.",
  "frontend/src/index.css": "Sets Tailwind base styles and design tokens for light and dark themes using CSS variables.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and the Internet Identity provider, then renders the root component.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard with field and task views, filtering, sorting, authentication checks, and field selection UI.",
  "frontend/src/utils/bootErrorMessages.ts": "Provides utilities to extract, normalize, and format error messages, including detecting missing-profile cases and IC trap messages.",
  "frontend/src/utils/duration.ts": "Contains helpers for converting between duration units and formatting minutes into human-readable strings.",
  "frontend/src/utils/fieldCreationErrors.ts": "Normalizes field-creation errors into user-friendly messages with categorized error types.",
  "frontend/src/utils/profileSaveErrors.ts": "Maps profile-save errors to clear categories and readable messages, handling nested IC error structures.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL parameters with session persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, layout, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the current project schema, version info, and a detailed list of implemented features for a task‑and‑field management system. Captures CRUD operations, scoring attributes, dependencies, computed Field stats, hidden-completed behavior, and backend APIs."
}