{
  "backend/main.mo": "Motoko canister defining user profiles, fields, tasks, and authorization logic with CRUD operations and role checks.",
  "feature_evidence.json": "Empty feature evidence report structure with no features listed.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend source files covering components, hooks, utilities, and behavior changes.",
  "frontend/docs/deploy-and-localdev-regression-checklist.md": "Comprehensive deployment and regression testing checklist for build, login flow, CRUD operations, and smoke tests.",
  "frontend/docs/field-create-failure-repro.md": "Guide documenting reproducible steps and expected behavior for field creation failures.",
  "frontend/docs/profile-save-failure-repro.md": "Detailed analysis of profile save failures, root cause, fixes, and validation steps.",
  "frontend/index.css": "Tailwind base styles and OKLCH variable definitions for light and dark themes.",
  "frontend/index.html": "Base HTML document loading React bootstrap scripts and root container.",
  "frontend/src/App.tsx": "Main React app orchestrating identity, actor boot, profile loading, error handling, and rendering of core UI.",
  "frontend/src/bootstrap/bootFallback.ts": "Provides a fallback UI that displays sanitized startup errors before React mounts, including console diagnostics and a styled error card with copy-to-clipboard support.",
  "frontend/src/bootstrap/preReactGlobals.ts": "Initializes global shims like process.env and globalThis before React loads, maps Vite env vars, and sets up the boot fallback handler.",
  "frontend/src/components/AllTasksView.tsx": "Renders a searchable and sortable list of tasks, fetching tasks and fields, and providing UI controls for filtering and sorting.",
  "frontend/src/components/CreateFieldDialog.tsx": "Dialog for creating a new field with authentication checks, backend initialization gating, and form submission via a mutation hook.",
  "frontend/src/components/CreateTaskDialog.tsx": "Dialog for creating a task with scale inputs, duration settings, dependency selection, and submission through a task creation mutation.",
  "frontend/src/components/EditFieldDialog.tsx": "Dialog for editing a field’s name, icon, and color, with state reset on open and update submission through a mutation hook.",
  "frontend/src/components/EditTaskDialog.tsx": "Dialog for editing a task, handling fields like name, scores, duration conversion, dependencies, and field reassignment.",
  "frontend/src/components/FieldCard.tsx": "Displays a field summary card with icon, task count, and averaged metrics.",
  "frontend/src/components/FieldDetailView.tsx": "Detail view for a field with task list, filtering, sorting, field metrics, and edit/delete actions.",
  "frontend/src/components/Footer.tsx": "Simple footer showing credits and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header with theme toggle, app title, and authenticated user menu with logout.",
  "frontend/src/components/ImportDataConfirmDialog.tsx": "Confirmation dialog warning users before overwriting all fields and tasks during import.",
  "frontend/src/components/LoginPrompt.tsx": "Login screen highlighting app features and enabling Internet Identity login.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to enter a name and save their profile after authentication.",
  "frontend/src/components/RecoverableBootError.tsx": "Displays a recoverable boot error with retry, logout, copy-to-clipboard, and expandable diagnostic details.",
  "frontend/src/components/SortDirectionToggle.tsx": "A button that toggles sort direction and shows a tooltip describing the current mode.",
  "frontend/src/components/TaskCard.tsx": "Renders a task card with completion, undo, edit, delete actions, dependency display, and attribute badges.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout, and identity persistence via a React context.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, fields, and tasks with detailed error handling.",
  "frontend/src/hooks/useResilientActor.ts": "Initializes a backend actor with retry logic and invalidates queries when the actor changes.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes, applying global background, text, and border styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads the root App component.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main dashboard UI with field/task views, search, sorting, authentication checks, and data import/export handling.",
  "frontend/src/utils/bootErrorMessages.ts": "Provides utilities to extract readable text from IC errors and detect specific cases like missing profiles or stopped canisters.",
  "frontend/src/utils/downloadJson.ts": "Exports objects as JSON files with BigInt handling and safe download logic.",
  "frontend/src/utils/duration.ts": "Contains helpers for converting duration units and formatting minute-based durations into readable strings.",
  "frontend/src/utils/exportUserDataErrors.ts": "Normalizes export-data errors into categorized, user‑friendly messages for login, actor, network, and backend issues.",
  "frontend/src/utils/fieldAppearance.ts": "Defines preset icons and colors for fields and helpers to resolve icon components and color values.",
  "frontend/src/utils/fieldCreationErrors.ts": "Normalizes field‑creation errors into clear categories, including login, actor readiness, authorization, and profile issues.",
  "frontend/src/utils/parseExportPayload.ts": "Validates and converts exported JSON into typed ExportPayload objects, restoring BigInts, Principals, and defaulting missing field appearance values.",
  "frontend/src/utils/profileSaveErrors.ts": "Normalizes profile save errors into categorized, user-friendly messages using message patterns and safe extraction.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based query values.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, container settings, animations, and plugins like typography and container queries.",
  "project_state.json": "Describes project metadata, features, and state for a task management app using ICP, React, and Motoko."
}