{
  "backend/main.mo": "Motoko backend actor defining users, fields, and tasks with authorization checks, CRUD operations, and profile management.",
  "feature_evidence.json": "Placeholder feature evidence report with an empty features list.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for multiple frontend source files.",
  "frontend/docs/deploy-and-localdev-regression-checklist.md": "Deployment and local development checklist covering build validation, smoke tests, and core functionality checks.",
  "frontend/docs/field-create-failure-repro.md": "Guide describing reproducible steps and expected behavior for field creation failure scenarios.",
  "frontend/docs/production-redeploy-runbook.md": "Runbook outlining steps and prerequisites for performing a clean production redeploy.",
  "frontend/docs/production-smoke-check-results-template.md": "Template for recording results of production smoke tests across authentication, CRUD, and UI flows.",
  "frontend/docs/profile-save-failure-repro.md": "Documentation of the profile save failure issue, root cause, fixes, and validation steps.",
  "frontend/index.css": "Tailwind setup defining CSS variables for light and dark themes and applying base styling.",
  "frontend/index.html": "HTML entry point rendering a root div and loading bootstrap and main React scripts.",
  "frontend/src/App.tsx": "Main app component handling authentication, actor/profile boot logic, and rendering appropriate UI or error flows.",
  "frontend/src/bootstrap/bootFallback.ts": "Bootstrap fallback system that displays a custom error UI if the app fails before React mounts.",
  "frontend/src/bootstrap/preReactGlobals.ts": "Sets up global shims and environment variables before loading React, then initializes the boot fallback system.",
  "frontend/src/components/AllTasksView.tsx": "Task list view with search, sorting, and loading states, rendering all tasks with field lookups.",
  "frontend/src/components/CreateFieldDialog.tsx": "Dialog for creating a new field with login handling, backend readiness checks, and form submission.",
  "frontend/src/components/CreateTaskDialog.tsx": "Dialog component for creating a new task with name, numeric attributes, duration, and dependencies, then submitting via useCreateTask.",
  "frontend/src/components/EditFieldDialog.tsx": "Dialog for editing a field’s name, icon, color, and background, updating it through useUpdateField.",
  "frontend/src/components/EditTaskDialog.tsx": "Dialog for editing a task’s fields, attributes, duration, dependencies, and optionally moving it to another field.",
  "frontend/src/components/FieldCard.tsx": "Displays a field summary card with icon, color, task count, and averaged task attributes.",
  "frontend/src/components/FieldDetailView.tsx": "Detailed view of a field showing its stats, sortable/searchable tasks, and dialogs for creating, editing, or deleting the field.",
  "frontend/src/components/Footer.tsx": "Simple footer with copyright text and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "App header with branding, theme toggle, and authenticated user menu with logout support.",
  "frontend/src/components/ImportDataConfirmDialog.tsx": "A confirmation dialog warning users before overwriting all existing fields and tasks with imported data.",
  "frontend/src/components/LoginPrompt.tsx": "Displays a login screen listing app features and triggers Internet Identity login.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal for entering and saving a user name, handling authentication and backend initialization states.",
  "frontend/src/components/RecoverableBootError.tsx": "Shows a recoverable boot error with retry, logout, and expandable diagnostic details.",
  "frontend/src/components/SortDirectionToggle.tsx": "A button that toggles sort direction with tooltip feedback.",
  "frontend/src/components/TaskCard.tsx": "Renders a task card with attributes, completion, editing, deletion, and dependency display.",
  "frontend/src/hooks/useActor.ts": "Initializes and caches a backend actor based on identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing login, stored identities, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profile, fields, tasks, and export/import data with detailed error handling and identity scoping.",
  "frontend/src/hooks/useResilientActor.ts": "Creates and caches a backend actor tied to Internet Identity, with retry logic and query invalidation on actor changes.",
  "frontend/src/index.css": "Sets up Tailwind and defines extensive light/dark theme CSS variables including field background palettes.",
  "frontend/src/main.tsx": "Bootstraps the React app, providing React Query and Internet Identity providers.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main dashboard UI for listing, searching, sorting, and managing fields and tasks, plus data import/export controls.",
  "frontend/src/utils/bootErrorMessages.ts": "Provides utilities to detect specific backend error patterns and extract user‑friendly error messages.",
  "frontend/src/utils/downloadJson.ts": "Exports a utility that serializes data to JSON (handling BigInt) and triggers a client‑side file download.",
  "frontend/src/utils/duration.ts": "Provides helpers to convert durations between units and format minutes into a readable string.",
  "frontend/src/utils/exportUserDataErrors.ts": "Normalizes various export-user-data errors into categorized, user-friendly messages.",
  "frontend/src/utils/fieldAppearance.ts": "Defines preset icons and colors and includes helpers to resolve icon components and color values.",
  "frontend/src/utils/fieldCardBackgrounds.ts": "Lists available field card background IDs and provides helpers to resolve background objects and CSS variables.",
  "frontend/src/utils/fieldCreationErrors.ts": "Maps field-creation-related errors into brief, categorized messages with login and authorization checks.",
  "frontend/src/utils/parseExportPayload.ts": "Validates and converts exported JSON into typed payload objects, restoring Principals and BigInts with defaults.",
  "frontend/src/utils/profileSaveErrors.ts": "Normalizes profile save errors, handling login, actor state, authorization traps, and unknown cases.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL or hash params, persist them in sessionStorage, and clear them from storage or the hash.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark mode, content paths, extended theme colors, layout options, animations, and plugin setup.",
  "project_state.json": "Tracks project state including UI improvement requests, known issues, and pending feature additions for layout, colors, and icons."
}