{
  "kind": "build_request",
  "title": "Fix intermittent blocking message: \"Please complete your profile to continue\"",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-15",
      "text": "Fix the false-positive detection of the \"User is not registered\" condition so the app does not incorrectly show the blocking message \"Please complete your profile to continue\" during normal usage.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Fix error: \"Please complete your profile to continue\""
        ]
      },
      "acceptanceCriteria": [
        "The helper used to detect the \"User is not registered\" condition (frontend/src/utils/bootErrorMessages.ts) no longer matches generic substrings like \"not registered\" that can misclassify unrelated errors.",
        "When a non-registration-related error occurs (e.g., actor/network/authorization errors), the UI does not display \"Please complete your profile to continue\" or \"Please complete your profile setup to continue.\" unless the backend error explicitly indicates the specific \"User is not registered\" condition."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Ensure authenticated users who truly have no profile are guided via the ProfileSetupModal flow (and not blocked by a boot error screen or toast) and that, after saving a profile successfully, the app proceeds to the Dashboard without showing the profile-completion blocking message.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Fix error: \"Please complete your profile to continue\""
        ]
      },
      "acceptanceCriteria": [
        "If an authenticated caller has no profile (getCallerUserProfile returns null or an equivalent \"not registered\" response), the ProfileSetupModal is shown and the user can continue after saving.",
        "After a successful profile save, the profile cache is refreshed and the ProfileSetupModal is dismissed in favor of the Dashboard (no persistent blocking state).",
        "The message \"Please complete your profile to continue\" is not shown during normal authenticated usage when the user already has a profile."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Standardize user-facing copy related to missing profile so it uses a single consistent English string across error normalization and boot messaging (avoid multiple near-duplicates).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Fix error: \"Please complete your profile to continue\""
        ]
      },
      "acceptanceCriteria": [
        "All user-visible messages for the true missing-profile condition are consistent across boot error normalization and profile-save error normalization.",
        "No user-facing missing-profile message is shown for errors unrelated to profile registration."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only UI primitives).",
    "Do not edit immutable frontend paths listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Keep backend as a single-actor Motoko canister; only add migration.mo changes if state schema must change (not expected for this fix).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new authentication providers (only Internet Identity is supported).",
    "Changing the backend data schema for Fields/Tasks/UserProfile unless strictly required to fix the error.",
    "Introducing new features unrelated to profile boot gating and error messaging."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}