{
  "kind": "build_request",
  "title": "Fix Field creation failure for authenticated users",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-15",
      "text": "Reproduce the reported failure where an authenticated user cannot create a Field, capture the exact frontend console output and the backend reject/trap message (if any), and identify the root cause (e.g., actor not ready, identity/actor mismatch, authorization trap, or failed query invalidation).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "I am trying to create a field but does not work"
        ]
      },
      "acceptanceCriteria": [
        "A short reproducible test case is documented (steps + expected vs actual + captured error message).",
        "The root cause is identified and summarized in developer-facing notes (what failed, where, and why)."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Fix Field creation so it works reliably for authenticated Internet Identity users, including cases immediately after logging in (avoid identity/actor readiness races). Ensure the createField call succeeds and the new Field becomes visible in the Fields list without requiring a full page refresh.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "I am trying to create a field but does not work"
        ]
      },
      "acceptanceCriteria": [
        "When logged in with Internet Identity (non-anonymous principal), creating a Field succeeds and a success toast is shown.",
        "After successful creation, the new Field appears in the dashboard Fields list automatically (no manual refresh).",
        "Creating multiple Fields in a row works consistently."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Improve user-facing error handling for Field creation failures to ensure the UI always provides a clear English explanation and a recovery path. Reuse existing normalization patterns (e.g., field creation error normalization) and ensure errors caused by missing authentication vs actor unavailability vs authorization are distinguishable to the user.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "I am trying to create a field but does not work"
        ]
      },
      "acceptanceCriteria": [
        "If the user is not logged in, the UI blocks submission and displays an English message indicating login is required.",
        "If the actor is not available/initializing, the UI displays an English message indicating the app is still connecting and the user can retry.",
        "If an authorization error occurs after login, the UI displays an English message suggesting logout/login as a remediation."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister (all logic in backend/main.mo).",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui."
  ],
  "nonGoals": [
    "Do not add new product features unrelated to Field creation reliability.",
    "Do not introduce external databases or non-Motoko backend services.",
    "Do not change the overall authentication provider (Internet Identity remains the only auth mechanism)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}