{
  "kind": "build_request",
  "title": "Remove backend Field deletion restrictions and allow deletion with existing tasks",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-7",
      "text": "Update backend Field deletion logic so a user can delete their own Field without any multi-creator restriction (i.e., do not require “at least two actors/users exist” to allow Field deletion).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "fix error: unable to delete field at least two actors required",
          "1. yes"
        ]
      },
      "acceptanceCriteria": [
        "When a user has only one principal/creator in the canister state, deleting a Field they own succeeds (does not trap with any “at least two actors/users required” error)."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Remove the backend rule that prevents Field deletion when the caller would have fewer than two Fields remaining (i.e., remove the “maintaining user fields requires at least two” restriction).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "2. yes remove the rule"
        ]
      },
      "acceptanceCriteria": [
        "If a user has exactly 1 Field, deleting that Field succeeds (subject only to the existing ownership/admin checks).",
        "If a user has exactly 2 Fields, deleting either Field succeeds (subject only to the existing ownership/admin checks)."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Allow deleting a Field regardless of whether it contains tasks (including incomplete/uncompleted tasks) by ensuring backend Field deletion cascades and removes all tasks belonging to the deleted Field and removes/cleans any task dependencies that reference tasks removed by the cascade.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "3. delete regardless tasks"
        ]
      },
      "acceptanceCriteria": [
        "Deleting a Field that contains uncompleted tasks succeeds.",
        "After Field deletion, no tasks remain in canister state with fieldId equal to the deleted FieldId.",
        "After Field deletion, remaining tasks do not contain dependency IDs that reference tasks that were deleted during the cascade."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister; implement changes in backend/main.mo.",
    "Do not introduce a schema/state migration unless strictly required by state shape changes (not expected for this change).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not add new authentication providers or change Internet Identity behavior.",
    "Do not change Field/Task schemas or introduce new persistence structures beyond what is required to remove the deletion restrictions.",
    "Do not add new UI flows; only ensure the existing UI can successfully delete Fields under the new backend rules."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}