{
  "kind": "build_request",
  "title": "Make all modals globally non-transparent and restore Heroicons rendering",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Apply a global, non-transparent styling fix to all modal/popup overlays and modal/popup content (current and future) so that dialogs are not visually transparent in either light or dark mode.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "fix modals/popups to not be transparent and restore predefines icon set rendering",
          "1. globally"
        ]
      },
      "acceptanceCriteria": [
        "All Dialog and AlertDialog overlays render with a clearly visible dimmed backdrop (not fully/partially transparent in a way that makes the modal hard to read) in both light and dark mode.",
        "All Dialog and AlertDialog content surfaces render with an opaque background consistent with the app theme tokens (e.g., popover/surface) in both light and dark mode.",
        "The fix is applied globally (i.e., no per-modal one-off requirement to make a modal readable); newly added dialogs automatically inherit the non-transparent behavior."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Restore Heroicons as the app’s predefined icon set and ensure icons render correctly across the project, including field icon rendering and icons shown inside dialogs/alerts/buttons.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Heroicons",
          "restore predefines icon set rendering"
        ]
      },
      "acceptanceCriteria": [
        "Field icon presets use Heroicons identifiers and resolve to Heroicons components at runtime without missing-icon fallbacks under normal conditions.",
        "Icons used within existing components (e.g., in CreateFieldDialog, ProfileSetupModal, ImportDataConfirmDialog) render correctly using Heroicons equivalents.",
        "Dynamic icon resolution (e.g., selecting an icon by string ID) works in production builds (no tree-shaking-related missing icons).",
        "No user-facing icon placeholders or broken SVGs appear in the main flows (Dashboard, Field cards, Task dialogs, Profile setup modal, Import confirmation dialog)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (they are read-only); achieve modal styling via global CSS overrides and/or by updating consuming components.",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "No backend (Motoko) changes.",
    "No new product features beyond fixing modal opacity and restoring the Heroicons icon set."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}