{
  "kind": "build_request",
  "title": "Fix login render crash caused by invalid field color string (\"teal\") and fall back to app default",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-4",
      "text": "Prevent the post-login dashboard render crash by ensuring FieldCard only passes valid hex colors into soft tint helpers and falls back to the app default color when the stored field color is not a hex value.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "Invalid hex color: teal",
          "after clicking the login button",
          "set to app's default"
        ]
      },
      "acceptanceCriteria": [
        "After clicking the login button, the app no longer throws a runtime render error \"Invalid hex color: teal\".",
        "The dashboard (including FieldCard components) renders successfully after login even if a field has color set to a non-hex string like \"teal\".",
        "When an invalid/non-hex field color is encountered, the UI uses the app's default color value (not the invalid string) for card tinting and related styling."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Make soft tint color utilities resilient: if the provided color string is not a valid 6-digit hex color, do not throw; instead use the app default color so the UI continues rendering.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "Invalid hex color: teal",
          "set to app's default"
        ]
      },
      "acceptanceCriteria": [
        "softColorTint helpers (card background + icon chip background) do not throw exceptions when given invalid input (e.g., \"teal\").",
        "For invalid input, the tint helpers return a valid hex color derived from the app default color.",
        "No React error boundary or boot fallback is triggered due to invalid color strings during normal navigation after login."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (Shadcn UI components are read-only).",
    "Do not modify immutable frontend hook files (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Keep backend as a single Motoko actor; no additional backend services or databases."
  ],
  "nonGoals": [
    "Adding new color themes or redesigning the UI beyond what is required to stop the crash.",
    "Changing the set of predefined colors available in the field color picker.",
    "Implementing new authentication providers (Internet Identity remains the only auth method)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}