{
  "kind": "build_request",
  "title": "Make All Tasks cards more compact by moving field tag into the task card",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the All Tasks view, remove the field badge currently rendered above each task card and instead render the task’s field tag as a small badge inside the TaskCard (e.g., in the card header row near the task title).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "in all tasks view make the cards more compact i.e. the field tag that the task belongs to can be in the tasks card not above it",
          "as a small tag inside the card"
        ]
      },
      "acceptanceCriteria": [
        "All Tasks view no longer shows a separate field badge above each card.",
        "Each task card in All Tasks view shows the field tag inside the card as a small badge."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Slightly reduce vertical spacing in the All Tasks view to make the task list more compact (reduce excess margins/padding between cards and within the card layout), without changing task functionality (complete/undo, edit, delete, dependencies display).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "yeah also reduce a bit the vertical spacing also"
        ]
      },
      "acceptanceCriteria": [
        "Vertical spacing between task cards in All Tasks view is reduced compared to current behavior.",
        "TaskCard actions and content remain usable and visually clear after spacing reduction."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Keep the field tag’s current visual style when moved inside the card (same badge variant/styling as currently used in AllTasksView).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "keep the current visual style"
        ]
      },
      "acceptanceCriteria": [
        "The field tag inside the task card uses the same styling (e.g., outline badge appearance) as before."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn components are read-only).",
    "Keep the current visual style of the field tag; only change its placement and spacing."
  ],
  "nonGoals": [
    "No backend changes.",
    "No changes to Field Detail view task cards beyond what is required to support the All Tasks view changes (e.g., if adding optional props to TaskCard, default behavior should remain unchanged elsewhere)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}