{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix post-login dashboard crash from invalid field color strings by validating hex and falling back to app default",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Ensure FieldCard only uses valid hex colors for soft tint styling and falls back to the app default when stored field color is not hex.",
      "acceptanceCriteria": [
        "After clicking the login button, the app no longer throws a runtime render error \"Invalid hex color: teal\".",
        "The dashboard (including FieldCard components) renders successfully after login even if a field has color set to a non-hex string like \"teal\".",
        "When an invalid/non-hex field color is encountered, the UI uses the app's default color value (not the invalid string) for card tinting and related styling."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FieldCard.tsx",
          "operation": "modify",
          "description": "Update FieldCard to pass a guaranteed-hex color into soft tint helpers (prefer the resolved hex from the field color palette; if the stored value is already a valid 6-digit hex, use it; otherwise fall back to the app default color). Ensure card tinting and related styling never use raw non-hex strings like \"teal\"."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Make soft tint utilities non-throwing by validating input and using the app default color when input is not a valid 6-digit hex color.",
      "acceptanceCriteria": [
        "softColorTint helpers (card background + icon chip background) do not throw exceptions when given invalid input (e.g., \"teal\").",
        "For invalid input, the tint helpers return a valid hex color derived from the app default color.",
        "No React error boundary or boot fallback is triggered due to invalid color strings during normal navigation after login."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/softColorTint.ts",
          "operation": "modify",
          "description": "Refactor soft tint generation to be resilient: add hex validation/normalization (6-digit hex with optional leading '#') and remove throwing behavior for invalid inputs. When invalid input is detected, use the app default hex color (from the existing field appearance defaults) as the tint source so getSoftCardBackground/getSoftIconChipBackground always return a valid hex color."
        }
      ]
    }
  ]
}