{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Dashboard FieldCard: 3-column attributes layout and user-selectable light background colors",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Adjust Dashboard FieldCard attributes to a responsive 3-column grid and enforce a single-row non-wrapping layout on large screens via horizontal scroll.",
      "acceptanceCriteria": [
        "On the dashboard fields view, each FieldCard shows the five attributes in a layout that uses 3 columns at the intended breakpoint(s).",
        "On large screens, the five attributes do not wrap onto multiple lines within a FieldCard; if they exceed available width, the attribute area remains a single row and can be horizontally scrolled.",
        "No other parts of the Dashboard (search/sort controls, field grid layout, field detail view) regress visually or functionally."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FieldCard.tsx",
          "operation": "modify",
          "description": "Update the attributes container layout to use a responsive 3-column grid on smaller breakpoints and switch to a non-wrapping single-row layout on large screens (e.g., flex + overflow-x-auto) so the five attributes never wrap on large displays."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Let users select a light background color for each Dashboard FieldCard via the existing field create/edit flow and apply the persisted selection when rendering cards.",
      "acceptanceCriteria": [
        "Users can choose a background color for a field card from a predefined light palette using the existing field edit flow (or an equivalent obvious UI affordance on the dashboard).",
        "The selected background color persists (survives page reload) and is applied whenever the field card is rendered on the dashboard.",
        "The background color choices are visually light (high-contrast with text/icons in both light and dark theme modes).",
        "Field create, edit, and list flows continue to work without errors."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Extend field create/update mutations to include the field card background color value using the existing backend capabilities for createField/updateField, and ensure fields queries continue to refetch/invalidate correctly after updates."
        },
        {
          "path": "frontend/src/components/CreateFieldDialog.tsx",
          "operation": "modify",
          "description": "Add a background color selection control to the field creation dialog (using the shared light palette) and pass the selected value through the create-field mutation."
        },
        {
          "path": "frontend/src/components/EditFieldDialog.tsx",
          "operation": "modify",
          "description": "Add a background color selection control to the field edit dialog (using the shared light palette), initialize it from the current field value, and pass the selected value through the update-field mutation."
        },
        {
          "path": "frontend/src/components/FieldCard.tsx",
          "operation": "modify",
          "description": "Apply the selected/persisted background color to the FieldCard container when rendering on the dashboard (with safe fallback if the stored value is missing/unknown)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Create and expose a consistent, reusable light background palette (stable IDs + English labels) for field card backgrounds.",
      "acceptanceCriteria": [
        "A fixed list of light background color options exists in code (with stable IDs) for reuse across the UI.",
        "User-facing labels for these colors are in English and displayed in the selection UI.",
        "Selecting each option visibly changes the field card background to the corresponding color."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/fieldCardBackgrounds.ts",
          "operation": "create",
          "description": "Define the fixed light background palette as a reusable frontend constant (stable IDs + English labels) and provide small helpers (e.g., default background ID, lookup/fallback, and CSS-variable name mapping) for use by dialogs and FieldCard rendering."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add theme-aware CSS variables for each light background palette option (separate values for light and dark modes as needed) so chosen backgrounds remain visually light while maintaining high contrast with text/icons in both themes."
        },
        {
          "path": "frontend/src/components/CreateFieldDialog.tsx",
          "operation": "modify",
          "description": "Wire the shared light background palette (IDs + labels) into the create-field selection UI so the user sees labels in English and the current selection is clearly indicated."
        },
        {
          "path": "frontend/src/components/EditFieldDialog.tsx",
          "operation": "modify",
          "description": "Wire the shared light background palette (IDs + labels) into the edit-field selection UI so the user sees labels in English and can switch backgrounds with immediate visual feedback."
        },
        {
          "path": "frontend/src/components/FieldCard.tsx",
          "operation": "modify",
          "description": "Use the shared palette helper(s) to resolve the stored background color ID into the correct theme-aware CSS variable (with fallback), ensuring selection changes are reflected when FieldCards render."
        }
      ]
    }
  ]
}