{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix false missing-profile detection and ensure ProfileSetupModal flow is the only missing-profile gate",
  "requirements": [
    {
      "id": "REQ-15",
      "summary": "Make missing-profile detection precise so unrelated errors no longer trigger the blocking missing-profile message.",
      "acceptanceCriteria": [
        "The helper used to detect the \"User is not registered\" condition (frontend/src/utils/bootErrorMessages.ts) no longer matches generic substrings like \"not registered\" that can misclassify unrelated errors.",
        "When a non-registration-related error occurs (e.g., actor/network/authorization errors), the UI does not display \"Please complete your profile to continue\" or \"Please complete your profile setup to continue.\" unless the backend error explicitly indicates the specific \"User is not registered\" condition."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/bootErrorMessages.ts",
          "operation": "modify",
          "description": "Tighten isUserNotRegisteredError to only match the explicit backend missing-profile condition (e.g., exact phrase/precise pattern) and remove broad substring matching (like generic \"not registered\"). Ensure extractSafeErrorMessage/normalizeBootError only map to the missing-profile message when the strict detector matches."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure the getCallerUserProfile query only treats truly-missing-profile responses as null (via the tightened detector) and continues to throw non-missing-profile errors so they surface as normal boot/auth/network issues rather than triggering profile gating."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Confirm boot error selection logic uses the tightened missing-profile detector so profile-fetch errors are only excluded from boot errors when they explicitly represent the missing-profile condition (preventing false positives from causing the blocking message)."
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Ensure authenticated users without a profile are guided through ProfileSetupModal and proceed to Dashboard immediately after a successful save without persistent blocking state.",
      "acceptanceCriteria": [
        "If an authenticated caller has no profile (getCallerUserProfile returns null or an equivalent \"not registered\" response), the ProfileSetupModal is shown and the user can continue after saving.",
        "After a successful profile save, the profile cache is refreshed and the ProfileSetupModal is dismissed in favor of the Dashboard (no persistent blocking state).",
        "The message \"Please complete your profile to continue\" is not shown during normal authenticated usage when the user already has a profile."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "On successful saveCallerUserProfile, immediately update the React Query cache for ['currentUserProfile'] with the saved profile (and then refetch/validate) so the ProfileSetupModal dismisses promptly and the app proceeds to Dashboard without lingering missing-profile state."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify showProfileSetup gating remains based on authenticated + profile fetched + userProfile === null (and no boot error), ensuring true missing-profile users see ProfileSetupModal instead of a boot error screen or toast-driven blocking state."
        },
        {
          "path": "frontend/src/components/ProfileSetupModal.tsx",
          "operation": "modify",
          "description": "Ensure the modal remains purely a guided setup flow (no boot-error style blocking messaging) and relies on the profile query cache refresh after save to allow transition to Dashboard cleanly."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Standardize missing-profile user-facing copy to one consistent English string across boot error normalization and profile-save error normalization.",
      "acceptanceCriteria": [
        "All user-visible messages for the true missing-profile condition are consistent across boot error normalization and profile-save error normalization.",
        "No user-facing missing-profile message is shown for errors unrelated to profile registration."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/bootErrorMessages.ts",
          "operation": "modify",
          "description": "Introduce and export a single shared constant for the missing-profile user-facing message (e.g., \"Please complete your profile to continue.\") and use it everywhere this condition is surfaced (boot normalization and safe extraction), ensuring only the strict missing-profile detector triggers it."
        },
        {
          "path": "frontend/src/utils/profileSaveErrors.ts",
          "operation": "modify",
          "description": "Replace any missing-profile copy with the shared missing-profile message constant from bootErrorMessages so profile-save error normalization uses the exact same user-facing string."
        },
        {
          "path": "frontend/src/utils/fieldCreationErrors.ts",
          "operation": "modify",
          "description": "Align the missing-profile-related copy (profile-required category) to the shared missing-profile message constant to avoid near-duplicate strings and ensure unrelated errors do not map to missing-profile messaging."
        }
      ]
    }
  ]
}