{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Field creation not-registered UX and add regression verification path",
  "requirements": [
    {
      "id": "REQ-16",
      "summary": "Normalize \"User is not registered\" Field-creation failures into a deterministic profile-setup prompt and refresh profile state so the ProfileSetupModal is shown when appropriate.",
      "acceptanceCriteria": [
        "When the backend rejects Field creation with an error containing \"User is not registered\" / \"not registered\", the user sees an English message that tells them to complete profile setup before creating Fields.",
        "In the same scenario, the app refetches/refreshes the current user profile state so the ProfileSetupModal is shown when appropriate (i.e., the app should not get stuck repeatedly failing Field creation without presenting the profile setup path).",
        "The normalized Field creation error no longer falls through to the generic \"Failed to create field: ...\" message for the not-registered condition."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/fieldCreationErrors.ts",
          "operation": "modify",
          "description": "Extend field creation error normalization to explicitly detect \"User is not registered\" / \"not registered\" errors and map them to a dedicated category and clear English message instructing the user to complete profile setup before creating Fields (so it does not fall through to the generic \"Failed to create field: ...\" message)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the Field creation mutation error handling to recognize the not-registered condition (reuse existing not-registered detection) and proactively refresh the current user profile query state (invalidate/refetch ['currentUserProfile']) so App.tsx can reliably show ProfileSetupModal after a not-registered createField failure."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Add a documented regression verification path that reproduces the prior intermittent \"User is not registered\" Field-creation failure after login and confirms the new behavior is fixed and/or consistently routes through profile setup.",
      "acceptanceCriteria": [
        "A documented set of steps exists to verify the fix in a fresh session and after profile save, covering Field creation success and ensuring the not-registered error is not observed.",
        "If an intentional not-registered block remains (only for truly un-onboarded users), the documented steps verify the UI reliably routes the user into profile setup and then Field creation succeeds after saving the profile."
      ],
      "file_operations": [
        {
          "path": "frontend/docs/field-create-failure-repro.md",
          "operation": "modify",
          "description": "Add a new regression check section that covers: fresh session login with Internet Identity, attempting to create a Field before profile setup (verifying the app prompts profile setup and refreshes profile state), completing profile setup, and confirming Field creation succeeds afterward without observing \"User is not registered\" errors."
        }
      ]
    }
  ]
}