{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 85,
  "summary": "Task management system where users create Fields and Tasks; each Task belongs to a Field, includes scoring attributes and dependencies; users can search/filter/sort tasks within a Field or globally; completed tasks are hidden; Field attributes are automatically calculated as averages of its Tasks.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Fields CRUD + Field detail navigation",
      "synonyms": [
        "Manage Fields",
        "Create/edit/delete Fields"
      ],
      "description": "Users can create, edit, delete, and list Fields; each Field can be opened in a dedicated detail view for managing its Tasks.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Tasks CRUD within a Field (with completion flag)",
      "synonyms": [
        "Manage Tasks",
        "Create/edit/delete Tasks"
      ],
      "description": "Users can create, edit, delete, and list Tasks scoped to a Field; Tasks support a completed flag and can be marked completed/uncompleted.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Task scoring attributes + duration",
      "synonyms": [
        "Task attributes",
        "Urgency/value/interest/influence/duration"
      ],
      "description": "Each Task stores numeric attributes urgency, value, interest, influence, and duration; UI supports entering and editing these values.",
      "reqIds": [
        "REQ-1",
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Task dependencies management",
      "synonyms": [
        "Dependencies",
        "Task-to-task references"
      ],
      "description": "Tasks can reference other Tasks as dependencies; UI and backend support updating dependencies.",
      "reqIds": [
        "REQ-1",
        "REQ-2",
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Hide completed Tasks by default",
      "synonyms": [
        "Completed tasks hidden",
        "Exclude completed"
      ],
      "description": "Completed Tasks are excluded from task list views/endpoints by default and disappear from task lists when marked completed.",
      "reqIds": [
        "REQ-2",
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Field computed attributes (averages)",
      "synonyms": [
        "Computed Field stats",
        "Field averages"
      ],
      "description": "Field attributes (urgency, value, interest, influence, duration) are automatically computed as averages over its non-completed Tasks and displayed in the UI.",
      "reqIds": [
        "REQ-1",
        "REQ-6"
      ],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Backend data models + persistence for Fields/Tasks",
      "synonyms": [
        "Persistence layer",
        "Motoko models"
      ],
      "description": "Backend canister includes persistent data models for Fields and Tasks, with Task-to-Field relationship, scoring attributes, dependencies, and completion status; Fields include computed attributes.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Backend CRUD APIs for Fields and Tasks",
      "synonyms": [
        "API endpoints",
        "Canister methods"
      ],
      "description": "Backend exposes CRUD APIs for Fields and Tasks, including listing tasks by Field and listing all tasks globally; supports updating task completion and dependencies; list endpoints exclude completed tasks by default.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Task search, filter, and sort within a Field",
      "synonyms": [
        "Field-scoped task query"
      ],
      "description": "Within a Field view, tasks can be searched across text fields and sorted/filtered using numeric task attributes and duration.",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Global Tasks view with search, filter, and sort",
      "synonyms": [
        "All Tasks view",
        "Cross-field task query"
      ],
      "description": "Provides a global task listing across all Fields with the same search/sort/filter capabilities as the Field view.",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "UI updates Field computed values when Tasks change",
      "synonyms": [
        "Reactive Field stats",
        "Live computed attributes"
      ],
      "description": "Field computed attribute values in the UI refresh correctly when tasks are created/edited/completed/uncompleted.",
      "reqIds": [
        "REQ-6"
      ],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Coherent visual theme (non-blue/purple primary)",
      "synonyms": [
        "App theming",
        "UI styling"
      ],
      "description": "Applies a consistent visual theme (colors/typography/layout) suitable for a task/priority tool, avoiding blue/purple as the primary colors.",
      "reqIds": [
        "REQ-7"
      ],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Authorization + Internet Identity login flow",
      "synonyms": [
        "Auth",
        "II login"
      ],
      "description": "Adds authorization infrastructure and a frontend login flow using Internet Identity; includes actor/hooks integration and gated UX where appropriate.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Static generated images integrated into UI asset pipeline",
      "synonyms": [
        "Generated assets",
        "Logo/background/empty state images"
      ],
      "description": "Supports adding required generated static images under frontend/public/assets/generated and rendering them in the UI (e.g., app shell/empty states).",
      "reqIds": [
        "REQ-8"
      ],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Recoverable global error handling for actor/canister failures",
      "synonyms": [
        "Global error experience",
        "Recoverable app error UI",
        "Error boundary + retry"
      ],
      "description": "Frontend provides a recoverable, user-friendly error experience when backend actor initialization or canister calls fail/trap, allowing the user to retry without losing the authenticated session (instead of a generic application crash screen).",
      "reqIds": [
        "REQ-9"
      ],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Hardened actor creation with optional admin access-control init",
      "synonyms": [
        "Optional caffeineAdminToken init",
        "Non-blocking access-control initialization"
      ],
      "description": "Frontend only calls actor._initializeAccessControlWithSecret when the caffeineAdminToken URL parameter is present and non-empty; initialization failures are handled non-blockingly (e.g., toast in English) and do not prevent normal authenticated/non-admin app usage.",
      "reqIds": [
        "REQ-10"
      ],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Resilient authenticated boot/profile flow with retry and logout actions",
      "synonyms": [
        "Auth boot resilience",
        "Profile boot retry",
        "Graceful authorization trap handling"
      ],
      "description": "If getCallerUserProfile (or related boot/profile calls) fail due to authorization or any canister trap, the UI shows a clear English message and offers actions to retry and/or log out rather than rendering a broken state.",
      "reqIds": [
        "REQ-11"
      ],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Backend authorization fixed to allow normal II users to access profiles/fields/tasks",
      "synonyms": [
        "Authorization trap fix",
        "Remove admin-token requirement for normal usage"
      ],
      "description": "Backend authorization failure path was corrected to prevent traps like \"Unauthorized: Only users can access profiles/fields/tasks\" during normal authenticated usage, ensuring a successfully authenticated Internet Identity user can access profile/fields/tasks without requiring an admin token.",
      "reqIds": [
        "REQ-12"
      ],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Fields sorting defaults to descending order",
      "synonyms": [
        "Default Fields sort: DESC",
        "Fields list descending by default"
      ],
      "description": "Fields list sorting now defaults to descending order (rather than ascending) on initial load, while still allowing the user to toggle sort direction.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Selected sort/filter criteria are visually highlighted on Field/Task cards",
      "synonyms": [
        "Active sort/filter highlighting",
        "UI emphasis for selected sort/filter"
      ],
      "description": "The UI visually indicates the currently selected sort/filter criterion in Field and Task cards/views so users can easily see which criterion is active.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Field duration aggregation correctly uses only active (non-completed) Tasks",
      "synonyms": [
        "Field duration fix",
        "Exclude completed tasks from duration sum"
      ],
      "description": "Field-level duration calculations now correctly aggregate duration using only active (non-completed) Tasks and compute the value accurately.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "User-friendly handling of Field creation failures (repro + error mapping)",
      "synonyms": [
        "Create Field failure UX",
        "Field creation error messages"
      ],
      "description": "Frontend includes documented reproduction steps for Field creation failures and utility/error-mapping code so Field creation errors surface as clear, actionable UI messages instead of failing silently or crashing.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Deployment/build pipeline fixed (app compiles + deploys successfully)",
      "synonyms": [
        "Fix deployment/build error",
        "Successful build + dfx deploy"
      ],
      "description": "Repository build/deploy configuration and scripts were updated so the project compiles and deploys successfully end-to-end (frontend + canister), resolving the prior deployment/build failure.",
      "reqIds": [
        "REQ-13"
      ],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Build-time checks added to catch deployment-breaking errors earlier",
      "synonyms": [
        "Pre-deploy validation",
        "Earlier build failure detection"
      ],
      "description": "Build pipeline was updated with additional build-time validations so common deployment-breaking issues (compile/config/candid/declarations mismatches) are caught earlier with clearer errors.",
      "reqIds": [
        "REQ-14"
      ],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "User-friendly handling of Profile save failures (repro + error mapping)",
      "synonyms": [
        "Profile save failure UX",
        "Profile error mapping"
      ],
      "description": "Frontend includes documented reproduction steps and error-mapping utilities so profile save failures surface as clear, actionable UI messages instead of failing silently or crashing.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-update-frontend-error-normalization-and-ui-behavior-so-that-if-field-creation-fails-with-a-user-is-not-registered-type-error-the-app-prompts-the-user-to-complete-profile-setup-instead-of-only-showing-a-generic-creation-failure-using-clear-english-user-facing-text",
      "title": "Update frontend error normalization and UI behavior so that if Field creation fails with a \"User is not registered\"-type error, the app prompts the user to complete profile setup (instead of only showing a generic creation failure), using clear English user-facing text.",
      "reqIds": [
        "REQ-16"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Eliminate the intermittent backend authorization/registration condition that causes Field creation to fail with the error text \"User is not registered\" for users who have successfully authenticated with Internet Identity.",
      "reqIds": [
        "REQ-15"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Add a regression check path (documentation and/or lightweight test coverage where this project already supports it) that reproduces the prior failure mode: login succeeds, then creating a Field intermittently fails with \"User is not registered\"; ensure the new build demonstrates the issue is fixed.",
      "reqIds": [
        "REQ-17"
      ],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Backend implemented as an Internet Computer canister (Motoko) with persistent storage for Fields and Tasks; frontend uses an actor client to call canister methods.",
    "Authorization layer added (authorization mixins/access-control) and frontend integrates Internet Identity for authentication.",
    "Task list endpoints and UI views exclude completed tasks by default (completed tasks are hidden unless explicitly included).",
    "Frontend uses a component library (shadcn/ui) and Tailwind-based styling for consistent theme/layout.",
    "Repository now includes a reusable build template scaffold (React + Vite + shadcn/ui + ICP canister configs) with build/deploy scripts and shared configuration under build-template/.",
    "Frontend linting/tooling includes custom ESLint rules to enforce Internet Identity provider usage and to avoid BigInt values in query keys.",
    "Build pipeline includes scripts to resize and prune generated images (build-template/scripts/resize-images.js and prune-unused-images.js).",
    "Authorization/access-control Motoko components were updated (component:authorization:v4.0.0), affecting backend authorization mixins and access-control module.",
    "Frontend auth/actor layer now treats access-control secret initialization as optional (driven by caffeineAdminToken URL param) and handles failures non-blockingly via UI messaging/toasts.",
    "Frontend boot/profile querying flow includes explicit handling for authorization/canister traps with retry/logout affordances instead of crashing the whole app."
  ],
  "known_issues": [
    "Intermittent \"User is not registered\" error prevents creating Fields (and sometimes causes app startup/application errors); manifests as \"field failed to be created\" / \"Application Error Occurred\"."
  ],
  "isFixRequest": true,
  "projectName": "Task management system with Fields, Tasks, dependencies, and advanced sorting/filtering/search",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}