{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 77,
  "summary": "Task management system where users create Fields and Tasks; each Task belongs to a Field, includes scoring attributes and dependencies; users can search/filter/sort tasks within a Field or globally; completed tasks are hidden; Field attributes are automatically calculated as averages of its Tasks.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Fields CRUD + Field detail navigation",
      "synonyms": [
        "Manage Fields",
        "Create/edit/delete Fields"
      ],
      "description": "Users can create, edit, delete, and list Fields; each Field can be opened in a dedicated detail view for managing its Tasks.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Tasks CRUD within a Field (with completion flag)",
      "synonyms": [
        "Manage Tasks",
        "Create/edit/delete Tasks"
      ],
      "description": "Users can create, edit, delete, and list Tasks scoped to a Field; Tasks support a completed flag and can be marked completed/uncompleted.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Task scoring attributes + duration",
      "synonyms": [
        "Task attributes",
        "Urgency/value/interest/influence/duration"
      ],
      "description": "Each Task stores numeric attributes urgency, value, interest, influence, and duration; UI supports entering and editing these values.",
      "reqIds": [
        "REQ-1",
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Task dependencies management",
      "synonyms": [
        "Dependencies",
        "Task-to-task references"
      ],
      "description": "Tasks can reference other Tasks as dependencies; UI and backend support updating dependencies.",
      "reqIds": [
        "REQ-1",
        "REQ-2",
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Hide completed Tasks by default",
      "synonyms": [
        "Completed tasks hidden",
        "Exclude completed"
      ],
      "description": "Completed Tasks are excluded from task list views/endpoints by default and disappear from task lists when marked completed.",
      "reqIds": [
        "REQ-2",
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Field computed attributes (averages)",
      "synonyms": [
        "Computed Field stats",
        "Field averages"
      ],
      "description": "Field attributes (urgency, value, interest, influence, duration) are automatically computed as averages over its non-completed Tasks and displayed in the UI.",
      "reqIds": [
        "REQ-1",
        "REQ-6"
      ],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Backend data models + persistence for Fields/Tasks",
      "synonyms": [
        "Persistence layer",
        "Motoko models"
      ],
      "description": "Backend canister includes persistent data models for Fields and Tasks, with Task-to-Field relationship, scoring attributes, dependencies, and completion status; Fields include computed attributes.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Backend CRUD APIs for Fields and Tasks",
      "synonyms": [
        "API endpoints",
        "Canister methods"
      ],
      "description": "Backend exposes CRUD APIs for Fields and Tasks, including listing tasks by Field and listing all tasks globally; supports updating task completion and dependencies; list endpoints exclude completed tasks by default.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Task search, filter, and sort within a Field",
      "synonyms": [
        "Field-scoped task query"
      ],
      "description": "Within a Field view, tasks can be searched across text fields and sorted/filtered using numeric task attributes and duration.",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Global Tasks view with search, filter, and sort",
      "synonyms": [
        "All Tasks view",
        "Cross-field task query"
      ],
      "description": "Provides a global task listing across all Fields with the same search/sort/filter capabilities as the Field view.",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "UI updates Field computed values when Tasks change",
      "synonyms": [
        "Reactive Field stats",
        "Live computed attributes"
      ],
      "description": "Field computed attribute values in the UI refresh correctly when tasks are created/edited/completed/uncompleted.",
      "reqIds": [
        "REQ-6"
      ],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Coherent visual theme (non-blue/purple primary)",
      "synonyms": [
        "App theming",
        "UI styling"
      ],
      "description": "Applies a consistent visual theme (colors/typography/layout) suitable for a task/priority tool, avoiding blue/purple as the primary colors.",
      "reqIds": [
        "REQ-7"
      ],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Authorization + Internet Identity login flow",
      "synonyms": [
        "Auth",
        "II login"
      ],
      "description": "Adds authorization infrastructure and a frontend login flow using Internet Identity; includes actor/hooks integration and gated UX where appropriate.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Static generated images integrated into UI asset pipeline",
      "synonyms": [
        "Generated assets",
        "Logo/background/empty state images"
      ],
      "description": "Supports adding required generated static images under frontend/public/assets/generated and rendering them in the UI (e.g., app shell/empty states).",
      "reqIds": [
        "REQ-8"
      ],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Recoverable global error handling for actor/canister failures",
      "synonyms": [
        "Global error experience",
        "Recoverable app error UI",
        "Error boundary + retry"
      ],
      "description": "Frontend provides a recoverable, user-friendly error experience when backend actor initialization or canister calls fail/trap, allowing the user to retry without losing the authenticated session (instead of a generic application crash screen).",
      "reqIds": [
        "REQ-9"
      ],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Hardened actor creation with optional admin access-control init",
      "synonyms": [
        "Optional caffeineAdminToken init",
        "Non-blocking access-control initialization"
      ],
      "description": "Frontend only calls actor._initializeAccessControlWithSecret when the caffeineAdminToken URL parameter is present and non-empty; initialization failures are handled non-blockingly (e.g., toast in English) and do not prevent normal authenticated/non-admin app usage.",
      "reqIds": [
        "REQ-10"
      ],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Resilient authenticated boot/profile flow with retry and logout actions",
      "synonyms": [
        "Auth boot resilience",
        "Profile boot retry",
        "Graceful authorization trap handling"
      ],
      "description": "If getCallerUserProfile (or related boot/profile calls) fail due to authorization or any canister trap, the UI shows a clear English message and offers actions to retry and/or log out rather than rendering a broken state.",
      "reqIds": [
        "REQ-11"
      ],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Backend authorization fixed to allow normal II users to access profiles/fields/tasks",
      "synonyms": [
        "Authorization trap fix",
        "Remove admin-token requirement for normal usage"
      ],
      "description": "Backend authorization failure path was corrected to prevent traps like \"Unauthorized: Only users can access profiles/fields/tasks\" during normal authenticated usage, ensuring a successfully authenticated Internet Identity user can access profile/fields/tasks without requiring an admin token.",
      "reqIds": [
        "REQ-12"
      ],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Fields sorting defaults to descending order",
      "synonyms": [
        "Default Fields sort: DESC",
        "Fields list descending by default"
      ],
      "description": "Fields list sorting now defaults to descending order (rather than ascending) on initial load, while still allowing the user to toggle sort direction.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Selected sort/filter criteria are visually highlighted on Field/Task cards",
      "synonyms": [
        "Active sort/filter highlighting",
        "UI emphasis for selected sort/filter"
      ],
      "description": "The UI visually indicates the currently selected sort/filter criterion in Field and Task cards/views so users can easily see which criterion is active.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Field duration aggregation correctly uses only active (non-completed) Tasks",
      "synonyms": [
        "Field duration fix",
        "Exclude completed tasks from duration sum"
      ],
      "description": "Field-level duration calculations now correctly aggregate duration using only active (non-completed) Tasks and compute the value accurately.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "User-friendly handling of Field creation failures (repro + error mapping)",
      "synonyms": [
        "Create Field failure UX",
        "Field creation error messages"
      ],
      "description": "Frontend includes documented reproduction steps for Field creation failures and utility/error-mapping code so Field creation errors surface as clear, actionable UI messages instead of failing silently or crashing.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-reproduce-the-reported-failure-where-an-authenticated-user-cannot-create-a-field-capture-the-exact-frontend-console-output-and-the-backend-reject-trap-message-if-any-and-identify-the-root-cause-e-g-actor-not-ready-identity-actor-mismatch-authorization-trap-or-failed-query-invalidation",
      "title": "Reproduce the reported failure where an authenticated user cannot create a Field, capture the exact frontend console output and the backend reject/trap message (if any), and identify the root cause (e.g., actor not ready, identity/actor mismatch, authorization trap, or failed query invalidation).",
      "reqIds": [
        "REQ-15"
      ],
      "version": 1
    },
    {
      "id": "feature-fix-field-creation-so-it-works-reliably-for-authenticated-internet-identity-users-including-cases-immediately-after-logging-in-avoid-identity-actor-readiness-races-ensure-the-createfield-call-succeeds-and-the-new-field-becomes-visible-in-the-fields-list-without-requiring-a-full-page-refresh",
      "title": "Fix Field creation so it works reliably for authenticated Internet Identity users, including cases immediately after logging in (avoid identity/actor readiness races). Ensure the createField call succeeds and the new Field becomes visible in the Fields list without requiring a full page refresh.",
      "reqIds": [
        "REQ-16"
      ],
      "version": 1
    },
    {
      "id": "feature-improve-user-facing-error-handling-for-field-creation-failures-to-ensure-the-ui-always-provides-a-clear-english-explanation-and-a-recovery-path-reuse-existing-normalization-patterns-e-g-field-creation-error-normalization-and-ensure-errors-caused-by-missing-authentication-vs-actor-unavailability-vs-authorization-are-distinguishable-to-the-user",
      "title": "Improve user-facing error handling for Field creation failures to ensure the UI always provides a clear English explanation and a recovery path. Reuse existing normalization patterns (e.g., field creation error normalization) and ensure errors caused by missing authentication vs actor unavailability vs authorization are distinguishable to the user.",
      "reqIds": [
        "REQ-17"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Fix deployment/build error so the app compiles and deploys successfully",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Reproduce the current deployment failure and capture the exact error output (build + deploy logs). Use that error output to identify the failing step (frontend build, Motoko compile, candid generation, dfx deploy, or post-deploy checks) and implement the minimal code/config fix required so the full deployment completes successfully.",
      "reqIds": [
        "REQ-13"
      ],
      "status": "pending"
    },
    {
      "id": "AR-6",
      "summary": "Add/adjust build-time checks (as appropriate for this repo) so that the class of failure that caused the deployment error is caught earlier (e.g., TypeScript compile failure, missing generated declarations, candid mismatch, or Motoko compile issue) and produces a clear, actionable error message during build.",
      "reqIds": [
        "REQ-14"
      ],
      "status": "pending"
    },
    {
      "id": "AR-7",
      "summary": "Fix Field creation failing (user cannot create a Field); identify root cause and ensure create Field works reliably for authenticated users",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Backend implemented as an Internet Computer canister (Motoko) with persistent storage for Fields and Tasks; frontend uses an actor client to call canister methods.",
    "Authorization layer added (authorization mixins/access-control) and frontend integrates Internet Identity for authentication.",
    "Task list endpoints and UI views exclude completed tasks by default (completed tasks are hidden unless explicitly included).",
    "Frontend uses a component library (shadcn/ui) and Tailwind-based styling for consistent theme/layout.",
    "Repository now includes a reusable build template scaffold (React + Vite + shadcn/ui + ICP canister configs) with build/deploy scripts and shared configuration under build-template/.",
    "Frontend linting/tooling includes custom ESLint rules to enforce Internet Identity provider usage and to avoid BigInt values in query keys.",
    "Build pipeline includes scripts to resize and prune generated images (build-template/scripts/resize-images.js and prune-unused-images.js).",
    "Authorization/access-control Motoko components were updated (component:authorization:v4.0.0), affecting backend authorization mixins and access-control module.",
    "Frontend auth/actor layer now treats access-control secret initialization as optional (driven by caffeineAdminToken URL param) and handles failures non-blockingly via UI messaging/toasts.",
    "Frontend boot/profile querying flow includes explicit handling for authorization/canister traps with retry/logout affordances instead of crashing the whole app.",
    "Backend authorization mixins/access-control logic updated to avoid canister traps for normally authenticated Internet Identity users accessing profiles/fields/tasks.",
    "Build template/core infrastructure was refreshed (component:core-infrastructure:v1.0.2), updating scaffolded configs/scripts (Dockerfile, deploy.sh, icp.yaml, pnpm workspace, and related build-template assets).",
    "Build template was expanded/standardized with the full React + Vite + Tailwind + shadcn/ui component set (component:shadcn-ui:v1.0.0, component:build-template-react:v1.0.0), including frontend scaffold configs, UI primitives, and workspace/package updates for reuse across projects.",
    "Repository build/scaffold baseline now aligns with component:initial-app:v1.0.0 (initial ICP + React app integration) and component:github-export-icp-cli:v1.0.0 (GitHub export tooling for ICP CLI), reflected across build-template and root scripts/config.",
    "Added explicit Field creation failure reproduction documentation (frontend/docs/field-create-failure-repro.md) and shared frontend error-mapping utilities (e.g., fieldCreationErrors.ts / bootErrorMessages.ts) to standardize handling of canister/authorization errors across UI flows."
  ],
  "known_issues": [
    "Deployment/build currently failing with a deployment error; needs investigation and fix",
    "Field creation is failing again (user reports they cannot create a Field)."
  ],
  "isFixRequest": true,
  "projectName": "Task management system with Fields, Tasks, dependencies, and advanced sorting/filtering/search",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}