{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Task Management System is an Internet Computer (ICP) web app (React + TanStack React Query frontend, Motoko canister backend) that uses Internet Identity for authentication and role-based access control. Authenticated users organize work into \"Fields\" (custom categories with user-chosen icon/color) and \"Tasks\". Tasks support prioritization attributes (urgency, value, interest, influence), duration with units (minutes/hours/days stored as minutes), dependencies, moving between fields, completion with undo, editing, and deletion. The backend computes per-field aggregate metrics (attribute averages and total active-task duration) based on uncompleted tasks. The frontend provides a dashboard with Fields and All Tasks views, robust boot/actor initialization with recoverable error UI, and JSON backup/restore via export/import with BigInt/Principal-safe parsing and backward-compatible defaults for older exports missing field icon/color.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication provider",
      "synonyms": [
        "InternetIdentityProvider",
        "AuthClient login",
        "II auth context"
      ],
      "description": "Provides a React context backed by @dfinity/auth-client to load persisted identities, perform Internet Identity login with long-lived delegation, expose login status flags, and logout/clear identity state.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Resilient backend actor initialization (identity-aware)",
      "synonyms": [
        "useResilientActor",
        "actor-init",
        "resilient-actor cache"
      ],
      "description": "Creates and caches a canister actor (anonymous or authenticated) using React Query; includes structured logging, stage='actor-init' error annotation, limited retry for network errors, and invalidates/refetches dependent queries when the actor instance changes across login/logout.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Legacy actor hook with access-control initialization via secret",
      "synonyms": [
        "useActor",
        "_initializeAccessControlWithSecret",
        "admin token bootstrap"
      ],
      "description": "Alternative actor hook that initializes backend access control by calling _initializeAccessControlWithSecret using a secret extracted from the URL hash/session, and forces refetch of dependent queries when identity changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Pre-React bootstrap shims and crash fallback UI",
      "synonyms": [
        "preReactGlobals",
        "bootFallback",
        "startup crash screen"
      ],
      "description": "Installs browser-safe shims for process/env/global and registers global error/unhandledrejection handlers that render a standalone, sanitized fallback UI if the app fails before React starts rendering.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Boot orchestration with recoverable error screen (retry + logout)",
      "synonyms": [
        "App boot flow",
        "RecoverableBootError",
        "boot retry"
      ],
      "description": "Coordinates identity initialization, actor readiness, and profile loading; shows initializing screen, login prompt when anonymous, profile setup when missing profile, and a recoverable boot error screen with diagnostics, retry (clears boot-critical caches and refetches), and logout (clears identity and query cache).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "IC/canister error normalization and diagnostics utilities",
      "synonyms": [
        "bootErrorMessages",
        "extractSafeErrorMessage",
        "isStoppedCanisterError",
        "isUserNotRegisteredError"
      ],
      "description": "Extracts readable text from nested IC error shapes, detects specific conditions (missing registration/profile and stopped canister), and normalizes errors into user-friendly messages plus structured diagnostics for UI/clipboard.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "User profile fetch/save with first-time setup modal",
      "synonyms": [
        "useGetCallerUserProfile",
        "useSaveCallerUserProfile",
        "ProfileSetupModal"
      ],
      "description": "Fetches the authenticated caller’s UserProfile with principal-scoped caching; shows a modal when the profile is missing; profile save is guarded against anonymous users and actor-not-ready states and uses normalized error messaging; on success updates cache and transitions into the dashboard.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Dashboard with Fields/All Tasks tabs and auth-guarded actions",
      "synonyms": [
        "Dashboard page",
        "Fields tab",
        "All Tasks tab"
      ],
      "description": "Main UI for managing fields and tasks. Includes search/sort controls for fields, navigation to field detail view, and action buttons (New Field, Export Data, Import Data) that are guarded by authentication and actor readiness states.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Fields CRUD with icon/color support",
      "synonyms": [
        "useGetAllFields",
        "useCreateField",
        "useUpdateField",
        "useDeleteField"
      ],
      "description": "Allows listing, creating (with default icon/color), updating (name + icon + color), and deleting fields. Frontend uses React Query invalidation and some optimistic cache updates on delete (also removes tasks in caches).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Predefined Field icon & color system",
      "synonyms": [
        "fieldAppearance",
        "PREDEFINED_ICONS",
        "PREDEFINED_COLORS"
      ],
      "description": "Defines a predefined set of Lucide icon IDs and a simple color palette, plus helpers to resolve stored IDs to renderable icon components and hex values with safe fallbacks and defaults.",
      "reqIds": [
        "REQ-5",
        "REQ-6"
      ],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Field cards and field detail view with metrics, search, and sorting",
      "synonyms": [
        "FieldCard",
        "FieldDetailView",
        "field metrics"
      ],
      "description": "Field cards visually reflect chosen icon/color and show active task counts plus backend-computed averages and duration totals. Field detail view shows metric badges and a searchable/sortable task list with create/edit/delete field actions.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Task creation with attributes, duration units, and dependencies",
      "synonyms": [
        "CreateTaskDialog",
        "useCreateTask",
        "task dependencies"
      ],
      "description": "Creates tasks with 1–5 scale attributes (urgency/value/interest/influence), duration with selectable unit, and optional dependencies (task ID list). Mutations invalidate tasks, allTasks, and fields to keep aggregates and lists updated.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Task editing including move-to-field and dependency management",
      "synonyms": [
        "EditTaskDialog",
        "useUpdateTask",
        "useMoveTaskToField"
      ],
      "description": "Edits task attributes, duration/unit (with conversion and support for empty/0 duration), and dependencies. Supports moving a task to another field (silent mutation) with an undo toast that moves it back.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Task completion lifecycle with undo",
      "synonyms": [
        "markTaskCompleted",
        "undoTaskCompletion",
        "TaskCard complete undo"
      ],
      "description": "Marks tasks completed (removing them from active views) and supports undo within a toast action window; consistently invalidates task and field queries to keep metrics and lists in sync.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Task deletion with confirmation",
      "synonyms": [
        "useDeleteTask",
        "TaskCard delete dialog"
      ],
      "description": "Deletes tasks via backend mutation and invalidates task/field caches; UI provides an AlertDialog confirmation and success/error toasts.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "All Tasks view (cross-field) with search and sorting",
      "synonyms": [
        "AllTasksView",
        "global task list"
      ],
      "description": "Displays all active (uncompleted) tasks across all fields with client-side search and sorting; shows the field name badge for each task by joining against the fields list.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Backend-powered task search and attribute-range filtering APIs (hooks available)",
      "synonyms": [
        "searchTasks",
        "filterTasksByAttribute",
        "useSearchTasks",
        "useFilterTasksByAttribute"
      ],
      "description": "Provides canister query methods (and corresponding React Query hooks) for field-scoped substring search and numeric attribute-range filtering for active tasks, gated by authorization checks.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Per-field aggregate metric recalculation in backend",
      "synonyms": [
        "recalculateFieldAverages",
        "avgUrgency/avgValue/avgInterest/avgInfluence",
        "totalActiveTaskDuration"
      ],
      "description": "Backend recomputes field averages and duration totals when tasks are created/updated/moved/completed/undone/deleted; aggregates are computed from uncompleted tasks while also tracking totals across all tasks.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Export user data as JSON (download)",
      "synonyms": [
        "exportUserData",
        "useExportUserData",
        "downloadJson"
      ],
      "description": "Authenticated users can export their fields and tasks via a guarded mutation; frontend serializes BigInt values safely and triggers a client-side JSON download with a date-stamped filename and normalized export error messages.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Import user data from JSON with validation and overwrite confirmation",
      "synonyms": [
        "importUserData",
        "useImportUserData",
        "parseExportPayload",
        "ImportDataConfirmDialog"
      ],
      "description": "Accepts a JSON file, parses/validates it (restoring BigInt and Principal types), applies defaults for older exports missing field icon/color, asks for destructive overwrite confirmation, imports via backend mutation, and invalidates all relevant caches afterward.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Backend role/admin management endpoints (AccessControl mixin)",
      "synonyms": [
        "MixinAuthorization",
        "getCallerUserRole",
        "isCallerAdmin",
        "assignCallerUserRole",
        "_initializeAccessControlWithSecret"
      ],
      "description": "Motoko mixin exposes access-control initialization (token-gated via environment variable), role queries, admin checks, and admin-only role assignment; core backend methods enforce permissions via requireUserPermission.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Backend data model includes Field icon/color and supports upgrade migration",
      "synonyms": [
        "Field.icon",
        "Field.color",
        "backend/migration.mo"
      ],
      "description": "Backend Field type persists icon and color fields; a migration module exists to backfill defaults on upgrade from an older Field record format.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "UI theming, header profile menu, and cache-clearing logout",
      "synonyms": [
        "Header",
        "next-themes",
        "logout clears react-query cache"
      ],
      "description": "Header provides light/dark theme toggle, displays user initials/name/principal snippet when profile exists, and logs out by clearing Internet Identity session and clearing all cached React Query data.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Operational documentation and regression checklists",
      "synonyms": [
        "repro guides",
        "deploy/localdev regression checklist"
      ],
      "description": "Includes documentation for reproducing key failures (field creation, profile save) and a comprehensive manual regression checklist covering build/deploy and core user flows (CRUD, search/sort, export/import, boot recovery).",
      "reqIds": [],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Change backend Field deletion rules: remove multi-creator restriction and 'each creator must retain at least two fields' rule; allow deleting a field regardless of existing tasks (cascade delete associated tasks).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Update backend Field deletion logic so a user can delete their own Field without any multi-creator restriction (i.e., do not require “at least two actors/users exist” to allow Field deletion).",
      "reqIds": [
        "REQ-7"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Remove the backend rule that prevents Field deletion when the caller would have fewer than two Fields remaining (i.e., remove the “maintaining user fields requires at least two” restriction).",
      "reqIds": [
        "REQ-8"
      ],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Allow deleting a Field regardless of whether it contains tasks (including incomplete/uncompleted tasks) by ensuring backend Field deletion cascades and removes all tasks belonging to the deleted Field and removes/cleans any task dependencies that reference tasks removed by the cascade.",
      "reqIds": [
        "REQ-9"
      ],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "ICP architecture: Motoko canister exposes Candid methods; frontend calls through a generated actor interface created via createActorWithConfig.",
    "Authorization uses an AccessControl module (admin/user/guest) and a Motoko mixin (MixinAuthorization) exposing role/admin endpoints and token-gated initialization.",
    "Frontend server-state is managed with @tanstack/react-query; all canister operations are wrapped in custom hooks (useQueries.ts).",
    "Actor lifecycle is encapsulated in useResilientActor with identity-aware caching, limited retry, and stage-annotated errors for better UX.",
    "App boot flow gates UI on identity + actor readiness + profile fetch; provides a recoverable boot error screen with retry (cache removal/refetch) and logout.",
    "Pre-React bootstrap layer installs browser shims (process/env/global) and a non-React boot fallback UI for early startup crashes.",
    "Principal-scoped query keys are used for currentUserProfile to avoid cross-user cache bleed.",
    "UI is built with shadcn/ui components + TailwindCSS and supports light/dark theme switching via next-themes.",
    "Export/import is implemented as JSON backup/restore with BigInt-safe serialization and strict payload parsing/validation (including Principal decoding).",
    "Field appearance is standardized via a predefined icon set and color palette, resolved at render time from stored IDs with safe fallbacks."
  ],
  "known_issues": [
    "New principals can trap in backend ensureUserRole(): AccessControl.getUserRole traps with \"User is not registered\" when no role exists; this can block profile/CRUD until some initialization path registers the user.",
    "useResilientActor does not call _initializeAccessControlWithSecret (unlike legacy useActor), so depending on deployment/ops, users may remain unregistered and hit authorization traps.",
    "importUserData trusts the incoming payload and does not validate that imported fields/tasks are owned by the caller (createdBy), allowing inconsistent or malicious data injection if the backend is exposed to arbitrary payloads.",
    "importUserData does not recalculate per-field aggregate metrics after import; averages/duration totals may be stale until subsequent task mutations trigger recalculation.",
    "Field deletion is constrained by backend rules (e.g., requires multiple distinct creators, requires a creator to retain at least two fields, and forbids deletion if any tasks are incomplete), which may conflict with the UI’s simpler delete messaging.",
    "Field cards compute active task counts by calling useGetTasksByField per field, which can lead to an N+1 query pattern for users with many fields.",
    "Duration unit conversions in the frontend use rounding (Math.round) when converting minutes↔hours/days, which can lose precision across repeated unit changes.",
    "Backend does not validate task dependency integrity (existence, ownership, cycles), so inconsistent dependency graphs can be stored (especially via import).",
    "Backend migration defaults (\"default_icon\" and a hex color) may not match the frontend’s expected icon IDs and palette IDs, relying on frontend fallbacks for unknown values."
  ],
  "isFixRequest": true,
  "gameProjectType": "none",
  "projectName": "Task Management System",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}